wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/*!
    \file    gd32h77x_nvmc.h
    \brief   definitions for the NVMC

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_NVMC_H
#define GD32H77X_NVMC_H

#include "gd32h77x.h"

#if (defined(GD32H77EXW) || (GD32H77DXW) || (GD32H779XW))
#define NVM_VER_CASE1
#elif (defined(GD32H77EXP) || (GD32H77DXP) || (GD32H779XP))
#define NVM_VER_CASE2
#elif (defined(GD32H77EXN) || (GD32H77DXN) || (GD32H779XN))
#define NVM_VER_CASE3
#elif (defined(GD32H77EXI) || (GD32H77DXI) || (GD32H779XI))
#define NVM_VER_CASE4
#endif

/* NVMC definition */
#define NVMC                                            NVMC_BASE                                           /*!< NVMC register base address */

/* ENVM registers definitions */
#define NVMC_ENVM_KEY                                   REG32((NVMC) + 0x00000004U)                         /*!< ENVM unlock key register */
#define NVMC_ENVM_CTL                                   REG32((NVMC) + 0x0000000CU)                         /*!< ENVM control register */
#define NVMC_ENVM_STAT                                  REG32((NVMC) + 0x00000010U)                         /*!< ENVM status register */
#define NVMC_ENVM_ADDR                                  REG32((NVMC) + 0x00000014U)                         /*!< ENVM address register */
#define NVMC_ENVM_CRCRESULT                             REG32((NVMC) + 0x0000005CU)                         /*!< ENVM CRC result register */
#define NVMC_ENVM_SW_REP_FATAL_ADDR                     REG32((NVMC) + 0x00000060U)                         /*!< ENVM software repair fatal address register */
#define NVMC_ENVM_REPCS                                 REG32((NVMC) + 0x000000C8U)                         /*!< ENVM repair function control and status register */
#define NVMC_ENVM_ROBBADDR0                             REG32((NVMC) + 0x000000CCU)                         /*!< ENVM read only bad block 0 address that still has the error after repair during self-check */
#define NVMC_ENVM_ROBBADDR1                             REG32((NVMC) + 0x000000D0U)                         /*!< ENVM read only bad block 1 address that still has the error after repair during self-check */
#define NVMC_ENVM_ROBBADDR2                             REG32((NVMC) + 0x000000D4U)                         /*!< ENVM read only bad block 2 address that still has the error after repair during self-check */
#define NVMC_ENVM_ROBBADDR3                             REG32((NVMC) + 0x000000D8U)                         /*!< ENVM read only bad block 3 address that still has the error after repair during self-check */
#define NVMC_ENVM_ROBBADDRX(x)                          REG32((NVMC) + 0x000000CCU + (uint32_t)((x) * 4U))  /*!< ENVM read only bad block 3 address that still has the error after repair during self-check */
#define NVMC_ENVM_AUTOERR1ADDR0                         REG32((NVMC) + 0x000000DCU)                         /*!< The address 0 where 1 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR1ADDR1                         REG32((NVMC) + 0x000000E0U)                         /*!< The address 1 where 1 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR1ADDR2                         REG32((NVMC) + 0x000000E4U)                         /*!< The address 2 where 1 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR1ADDR3                         REG32((NVMC) + 0x000000E8U)                         /*!< The address 3 where 1 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR1ADDRX(x)                      REG32((NVMC) + 0x000000DCU + (uint32_t)((x) * 4U))  /*!< The address x(x=0,1,2,3) where 1 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR2ADDR0                         REG32((NVMC) + 0x000000ECU)                         /*!< The address 0 where 2 bits error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR2ADDR1                         REG32((NVMC) + 0x000000F0U)                         /*!< The address 1 where 2 bits error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR2ADDR2                         REG32((NVMC) + 0x000000F4U)                         /*!< The address 2 where 2 bits error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR2ADDR3                         REG32((NVMC) + 0x000000F8U)                         /*!< The address 3 where 2 bits error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR2ADDRX(x)                      REG32((NVMC) + 0x000000ECU + (uint32_t)((x) * 4U))  /*!< The address x(x=0,1,2,3) where 2 bits error occurs when the bus reads ENVM */
#define NVMC_ENVM_UNREPECCADDR0                         REG32((NVMC) + 0x00000110U)                         /*!< ENVM self-check unrepaired ECC error address 0 register */
#define NVMC_ENVM_UNREPECCADDR1                         REG32((NVMC) + 0x00000114U)                         /*!< ENVM self-check unrepaired ECC error address 1 register */
#define NVMC_ENVM_UNREPECCADDR2                         REG32((NVMC) + 0x00000118U)                         /*!< ENVM self-check unrepaired ECC error address 2 register */
#define NVMC_ENVM_UNREPECCADDR3                         REG32((NVMC) + 0x0000011CU)                         /*!< ENVM self-check unrepaired ECC error address 3 register */
#define NVMC_ENVM_UNREPECCADDR4                         REG32((NVMC) + 0x00000120U)                         /*!< ENVM self-check unrepaired ECC error address 4 register */
#define NVMC_ENVM_UNREPECCADDR5                         REG32((NVMC) + 0x00000124U)                         /*!< ENVM self-check unrepaired ECC error address 5 register */
#define NVMC_ENVM_UNREPECCADDRX(x)                      REG32((NVMC) + 0x00000110U + (uint32_t)((x) * 4U))  /*!< ENVM self-check unrepaired ECC error address x(x=0,1,2,3,4,5) register */
#define NVMC_ENVM_OTAFAILADDR                           REG32((NVMC) + 0x00000128U)                         /*!< ENVM OTA fail address register */
#define NVMC_ENVM_PFINJ_KEY                             REG32((NVMC) + 0x000001F0U)                         /*!< ENVM program fault inject unlock key register */
#define NVMC_ENVM_PFINJ                                 REG32((NVMC) + 0x000001F4U)                         /*!< ENVM program fault inject register */

/* flash registers definitions */
#define NVMC_FLASH_KEY                                  REG32((NVMC) + 0x00000150U)                         /*!< NVMC_FLASH_CTL unlock key register */
#define NVMC_FLASH_CTL                                  REG32((NVMC) + 0x00000154U)                         /*!< flash control register */
#define NVMC_FLASH_STAT                                 REG32((NVMC) + 0x00000158U)                         /*!< flash status register */
#define NVMC_FLASH_ADDR                                 REG32((NVMC) + 0x0000015CU)                         /*!< flash address register */
#define NVMC_FLASH_ECCADDR                              REG32((NVMC) + 0x00000160U)                         /*!< flash ECC error address register */

/* NVMC registers definitions */
#define NVMC_PERFCTL                                    REG32((NVMC) + 0x00000000U)                         /*!< NVMC performance control register */
#define NVMC_OBKEY                                      REG32((NVMC) + 0x00000008U)                         /*!< NVMC option byte unlock key register */
#define NVMC_OBCTL                                      REG32((NVMC) + 0x00000018U)                         /*!< NVMC option byte control register */
#define NVMC_OBSTAT0_EFT                                REG32((NVMC) + 0x0000001CU)                         /*!< NVMC effective option byte status0 register */
#define NVMC_OBSTAT0_MDF                                REG32((NVMC) + 0x00000020U)                         /*!< NVMC modified option byte status0 register */
#define NVMC_DCRPADDR_EFT                               REG32((NVMC) + 0x00000028U)                         /*!< NVMC effective DCRP address register */
#define NVMC_DCRPADDR_MDF                               REG32((NVMC) + 0x0000002CU)                         /*!< NVMC modified DCRP address register */
#define NVMC_SCRADDR_EFT                                REG32((NVMC) + 0x00000030U)                         /*!< NVMC effective secure address register */
#define NVMC_SCRADDR_MDF                                REG32((NVMC) + 0x00000034U)                         /*!< NVMC modified secure address register */
#define NVMC_WP_ENVM_EFT                                REG32((NVMC) + 0x00000038U)                         /*!< ENVM effective erase/program protection register */
#define NVMC_WP_ENVM_MDF                                REG32((NVMC) + 0x0000003CU)                         /*!< ENVM modified erase/program protection register */
#define NVMC_BTADDR_EFT                                 REG32((NVMC) + 0x00000040U)                         /*!< NVMC effective boot address register */
#define NVMC_BTADDR_MDF                                 REG32((NVMC) + 0x00000044U)                         /*!< NVMC modified boot address register */
#define NVMC_OBSTAT1_EFT                                REG32((NVMC) + 0x00000050U)                         /*!< NVMC effective option byte status1 register */
#define NVMC_OBSTAT1_MDF                                REG32((NVMC) + 0x00000054U)                         /*!< NVMC modified option byte status1 register */
#define NVMC_WP0_FLASH_EFT                              REG32((NVMC) + 0x00000080U)                         /*!< NVMC flash effective erase/program protection register 0 */
#define NVMC_WP1_FLASH_EFT                              REG32((NVMC) + 0x00000084U)                         /*!< NVMC flash effective erase/program protection register 1 */
#define NVMC_WP0_FLASH_MDF                              REG32((NVMC) + 0x00000088U)                         /*!< NVMC flash modified erase/program protection register 0 */
#define NVMC_WP1_FLASH_MDF                              REG32((NVMC) + 0x0000008CU)                         /*!< NVMC flash modified erase/program protection register 1 */
#define NVMC_OBREPCTL_EFT                               REG32((NVMC) + 0x00000090U)                         /*!< NVMC effective option byte repair control register */
#define NVMC_OBREPCTL_MDF                               REG32((NVMC) + 0x00000094U)                         /*!< NVMC modified option byte repair control register */
#define NVMC_OBREPSTADDR_EFT                            REG32((NVMC) + 0x00000098U)                         /*!< NVMC effective option byte repair start address register */
#define NVMC_OBREPENDADDR_EFT                           REG32((NVMC) + 0x0000009CU)                         /*!< NVMC effective option byte repair end address register */
#define NVMC_OBREPSTADDR_MDF                            REG32((NVMC) + 0x000000A0U)                         /*!< NVMC modified option byte repair start address register */
#define NVMC_OBREPENDADDR_MDF                           REG32((NVMC) + 0x000000A4U)                         /*!< NVMC modified option byte repair end address register */
#define NVMC_OBBBADDRX_EFT(x)                           REG32((NVMC) + 0x000000A8U + (uint32_t)((x) * 4U))  /*!< NVMC effective option byte bad block x(x=0,1,2,3) address register */
#define NVMC_OBBBADDRX_MDF(x)                           REG32((NVMC) + 0x000000B8U + (uint32_t)((x) * 4U))  /*!< NVMC modified option byte bad block x(x=0,1,2,3) address register */
#define NVMC_BLANKADDR                                  REG32((NVMC) + 0x000000FCU)                         /*!< NVMC blank address register  */
#define NVMC_PID0                                       REG32((NVMC) + 0x00000100U)                         /*!< product ID register 0 */
#define NVMC_PID1                                       REG32((NVMC) + 0x00000104U)                         /*!< product ID register 1 */
#define NVMC_NMIERRADDR                                 REG32((NVMC) + 0x00000108U)                         /*!< NVMC not maskable interrupt error address register  */

