wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_ENVM_ADDR */
#define NVMC_ENVM_ADDR_ADDR                             BITS(0,31)                                          /*!< ENVM erase command address bits */

/* NVMC_ENVM_CRCRESULT */
#define NVMC_ENVM_CRCRESULT_CRC_RESULT                  BITS(0,31)                                          /*!< ENVM CRC result bits */

/* NVMC_ENVM_SW_REP_FATAL_ADDR */
#define NVMC_ENVM_SW_REP_FATAL_ADDR_SW_REP_FATAL_ADDR   BITS(0,31)                                          /*!< The first blank address of the flash backup area or fatal address detected by software self-check bits */

/* NVMC_ENVM_REPCS */
#define NVMC_ENVM_REPCS_ERR2CNT                         BITS(27,31)                                         /*!< the number of 2 bit error occurrences without repair during the self-check */
#define NVMC_ENVM_REPCS_ERR1CNT                         BITS(22,26)                                         /*!< the number of 1 bit error occurrences without repair during the self-check */
#define NVMC_ENVM_REPCS_BLANKMODE                       BIT(20)                                             /*!< Flash backup content blank mode */
#define NVMC_ENVM_REPCS_ROBBCNT                         BITS(16,19)                                         /*!< the number of repair failures during the self-check */
#define NVMC_ENVM_REPCS_ECC2CNTIE                       BIT(15)                                             /*!< the number of 2 bit errors is greater than or equal to the threshold interrupt enable */
#define NVMC_ENVM_REPCS_ECC1CNTIE                       BIT(14)                                             /*!< the number of 1 bit error is greater than or equal to the threshold Interrupt enable */
#define NVMC_ENVM_REPCS_ECC2CNTIF                       BIT(13)                                             /*!< flag generated when the number of 2 bit errors is greater than or equal to the threshold */
#define NVMC_ENVM_REPCS_ECC1CNTIF                       BIT(12)                                             /*!< flag generated when the number of 1 bit error is greater than or equal to the threshold */
#define NVMC_ENVM_REPCS_REPERRSTAT                      BITS(8,11)                                          /*!< self-check result, error status */
#define NVMC_ENVM_REPCS_BLREPDONE                       BIT(7)                                              /*!< bootloader writes the register to release the CPU after the bootloader self-check is done */
#define NVMC_ENVM_REPCS_FLBLANKIE                       BIT(6)                                              /*!< the flash backup content blank interruption was enabled */
#define NVMC_ENVM_REPCS_FLBLANK                         BIT(5)                                              /*!< flash backup content is blank flag */
#define NVMC_ENVM_REPCS_NMIERRINT                       BIT(4)                                              /*!< AXI read, repair failure with 3-bit error */
#define NVMC_ENVM_REPCS_REPDONEIE                       BIT(3)                                              /*!< self-repair done interrupt enable */
#define NVMC_ENVM_REPCS_REPEND                          BIT(2)                                              /*!< self-repair end flag */
#define NVMC_ENVM_REPCS_REPSTRERR                       BIT(1)                                              /*!< self-check repair configuration error bit */
#define NVMC_ENVM_REPCS_REPSTART                        BIT(0)                                              /*!< repair start bit */

/* NVMC_ENVM_ROBBADDRX */
#define NVMC_ENVM_ROBBADDRX_ROBBADDR                    BITS(5,20)                                          /*!< the address that still has the error after repair during the self-check process */
#define NVMC_ENVM_ROBBADDRX_ROBBADDRSTAT                BITS(0,1)                                           /*!< state of ROBBADDR */

/* NVMC_ENVM_AUTOERR1ADDRX */
#define NVMC_ENVM_AUTOERR1ADDRX_AUTOERR1ADDR            BITS(5,31)                                          /*!< the address where 1 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR1ADDRX_AUTOERR1ADDRSTAT        BIT(0)                                              /*!< state of AUTOERR1ADDR */

/* NVMC_ENVM_AUTOERR2ADDRX */
#define NVMC_ENVM_AUTOERR2ADDRX_AUTOERR2ADDR            BITS(5,31)                                          /*!< the address where 2 bit error occurs when the bus reads ENVM */
#define NVMC_ENVM_AUTOERR2ADDRX_AUTOERR2ADDRSTAT        BIT(0)                                              /*!< state of AUTOERR2ADDR */

/* NVMC_ENVM_UNREPECCADDRX */
#define NVMC_ENVM_UNREPECCADDRX_ERRADDR                 BITS(5,20)                                          /*!< the 1/2 bit error address that occurs if it is not repaired during the self-check process */
#define NVMC_ENVM_UNREPECCADDRX_ERRADDRSTAT             BITS(0,1)                                           /*!< state of ERRADDR */

/* NVMC_ENVM_OTAFAILADDR */
#define NVMC_ENVM_OTAFAILADDR_OTAFAILADDR               BITS(0,20)                                          /*!< the 1/2 bit error address that occurs if it is not repaired during the self-check process */

/* NVMC_ENVM_PFINJ_KEY */
#define NVMC_ENVM_PFINJ_KEY_PFINJ_KEY                   BITS(0,31)                                          /*!< NVMC_ENVM_PFINJ unlock register bit */

/* NVMC_ENVM_PFINJ */
#define NVMC_ENVM_PFINJ_ENVM0_PFINJ_DATA                BITS(4,6)                                           /*!< when PFINJEN[1:0] is set to 0x3, ENVM0_PFINJ_DATA[*] is set 1, the corresponding position of ENVM0_DATAIN[*] is reversed */
#define NVMC_ENVM_PFINJ_ENVM1_PFINJ_DATA                BITS(7,9)                                           /*!< when PFINJEN[1:0] is set to 0x3, ENVM1_PFINJ_DATA[*] is set 1, the corresponding position of ENVM1_DATAIN[*] is reversed */
#define NVMC_ENVM_PFINJ_PFINJEN                         BITS(12,13)                                         /*!< program fault inject enable bit */

/* flash bits definitions */
/* NVMC_FLASH_KEY */
#define NVMC_FLASH_KEY_KEY                              BITS(0,31)                                          /*!< NVMC_FLASH_CTL unlock key bits */

