wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_FLASH_CTL */
#define NVMC_FLASH_CTL_LK                               BIT(0)                                              /*!< NVMC_FLASH_CTL lock bit */
#define NVMC_FLASH_CTL_PG                               BIT(1)                                              /*!< main flash program command bit */
#define NVMC_FLASH_CTL_SER                              BIT(2)                                              /*!< main flash sector erase command bit */
#define NVMC_FLASH_CTL_MER                              BIT(3)                                              /*!< main flash mass erase command bit */
#define NVMC_FLASH_CTL_PGCHEN                           BIT(4)                                              /*!< check programming area enable bit */
#define NVMC_FLASH_CTL_PER                              BIT(6)                                              /*!< page erase command bit */
#define NVMC_FLASH_CTL_START                            BIT(7)                                              /*!< send erase command to flash bit */
#define NVMC_FLASH_CTL_ENDIE                            BIT(16)                                             /*!< end of operation interrupt enable bit */
#define NVMC_FLASH_CTL_WPERRIE                          BIT(17)                                             /*!< write protection error interrupt enable bit */
#define NVMC_FLASH_CTL_PGSERRIE                         BIT(18)                                             /*!< program sequence error interrupt enable bit */
#define NVMC_FLASH_CTL_RPERRIE                          BIT(23)                                             /*!< read protection error interrupt enable bit */
#define NVMC_FLASH_CTL_RSERRIE                          BIT(24)                                             /*!< read secure error interrupt enable bit */
#define NVMC_FLASH_CTL_ECCDETIE                         BIT(26)                                             /*!< two bits detect error interrupt enable bit */
#define NVMC_FLASH_CTL_CHIP_REMOVE_EN                   BIT(31)                                             /*!< protection-removed chip erase enable bit */

/* NVMC_FLASH_STAT */
#define NVMC_FLASH_STAT_BUSY                            BIT(0)                                              /*!< flash busy flag bit */
#define NVMC_FLASH_STAT_ENDF                            BIT(16)                                             /*!< end of operation flag bit */
#define NVMC_FLASH_STAT_WPERR                           BIT(17)                                             /*!< write protection error flag bit */
#define NVMC_FLASH_STAT_PGSERR                          BIT(18)                                             /*!< program sequence error flag bit */
#define NVMC_FLASH_STAT_RPERR                           BIT(23)                                             /*!< read protection error flag bit */
#define NVMC_FLASH_STAT_RSERR                           BIT(24)                                             /*!< read secure error flag bit */
#define NVMC_FLASH_STAT_ECCDET                          BIT(26)                                             /*!< two bits detect error flag bit */
#define NVMC_FLASH_STAT_FECCF                           BIT(31)                                             /*!< flash ECC function flag */

/* NVMC_FLASH_ADDR */
#define NVMC_FLASH_ADDR_ADDR                            BITS(0,31)                                          /*!< flash erase command address bits */

/* NVMC_FLASH_ECCADDR */
#define NVMC_FLASH_ECCADDR_ECCADDR                      BITS(0,31)                                          /*!< address of byte where an ECC error is detected */

/* NVMC bits definitions */
/* NVMC_PERFCTL */
#define NVMC_PERFCTL_EMPTY_ENVM_BUF                     BIT(31)                                             /*!< empty ENVM buffer (general buffer and CPU buffer) function */
#define NVMC_PERFCTL_ENVM_BUF_MODE                      BIT(24)                                             /*!< ENVM buffer mode */
#define NVMC_PERFCTL_FLASH_BUF_PFETCH                   BITS(22,23)                                         /*!< flash buffer prefetch control */
#define NVMC_PERFCTL_FLASH_PG_SZ                        BITS(20,21)                                         /*!< flash program size */
#define NVMC_PERFCTL_ENVM_GP_BUFSZ                      BITS(18,19)                                         /*!< ENVM general buffer size (for other masters) */
#define NVMC_PERFCTL_ENVM_CPU_BUFSZ                     BITS(16,17)                                         /*!< ENVM cpu buffer size, the buffer size takes effect after a reset */
#define NVMC_PERFCTL_DTREN                              BIT(15)                                             /*!< flash DTR mode enable bit */
#define NVMC_PERFCTL_WSCNT                              BITS(0,3)                                           /*!< wait state counter register */

/* NVMC_OBKEY */
#define NVMC_OBKEY_OBKEY                                BITS(0,31)                                          /*!< option byte unlock key bits */

/* NVMC_OBCTL */
#define NVMC_OBCTL_OBLK                                 BIT(0)                                              /*!< NVMC_OBCTL lock bit */
#define NVMC_OBCTL_OBSTART                              BIT(1)                                              /*!< send option byte change command to flash */
#define NVMC_OBCTL_OBMERRIE                             BIT(30)                                             /*!< option byte modified error interrupt enable bit */
#define NVMC_OBCTL_OBMERR                               BIT(31)                                             /*!< option byte modified error flag */

/* NVMC_OBSTAT0_EFT */
#define NVMC_OBSTAT0_EFT_DISLFI                         BIT(0)                                              /*!< effective option byte Licensed firmware install (LFI) disable bit */
#define NVMC_OBSTAT0_EFT_NOPRINT                        BIT(1)                                              /*!< effective option byte no information is printed during secure boot */
#define NVMC_OBSTAT0_EFT_BOR_TH                         BITS(2,3)                                           /*!< effective option byte brownout reset threshold value */
#define NVMC_OBSTAT0_EFT_NWDG_HW                        BIT(4)                                              /*!< effective option byte watchdog value */
#define NVMC_OBSTAT0_EFT_VFALL                          BIT(5)                                              /*!< effective option byte Firmware image verification enable bit */
#define NVMC_OBSTAT0_EFT_NRST_DPSLP                     BIT(6)                                              /*!< effective option byte deepsleep reset value */
#define NVMC_OBSTAT0_EFT_NRST_STDBY                     BIT(7)                                              /*!< effective option byte standby reset value */
#define NVMC_OBSTAT0_EFT_SPC                            BITS(8,15)                                          /*!< effective option byte security protection code */
#define NVMC_OBSTAT0_EFT_OTA_CHECK                      BIT(16)                                             /*!< effective option byte OTA check status bit */
#define NVMC_OBSTAT0_EFT_FWDGSPD_DPSLP                  BIT(17)                                             /*!< effective option byte watchdog suspend status in deepsleep mode */
#define NVMC_OBSTAT0_EFT_FWDGSPD_STDBY                  BIT(18)                                             /*!< effective option byte watchdog suspend status in standby mode */
#define NVMC_OBSTAT0_EFT_FW_UPDATE                      BIT(19)                                             /*!< effective option byte Firmware update status bit */
#define NVMC_OBSTAT0_EFT_SWAP                           BIT(20)                                             /*!< effective option byte SWAP status bit */
#define NVMC_OBSTAT0_EFT_SCR                            BIT(21)                                             /*!< effective option byte security access mode status bit */
#define NVMC_OBSTAT0_EFT_ITCMECCEN                      BIT(22)                                             /*!< effective option byte ITCM ECC function enable status bit */
#define NVMC_OBSTAT0_EFT_DTCM0ECCEN                     BIT(23)                                             /*!< effective option byte DTCM0 ECC function enable status bit */
#define NVMC_OBSTAT0_EFT_DTCM1ECCEN                     BIT(24)                                             /*!< effective option byte DTCM1 ECC function enable status bit */
#define NVMC_OBSTAT0_EFT_R2_SRAM_ECCEN                  BIT(25)                                             /*!< effective option byte Region 2 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_EFT_R1_SRAM_ECCEN                  BIT(26)                                             /*!< effective option byte Region 1 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_EFT_R0_SRAM_ECCEN                  BIT(27)                                             /*!< effective option byte Region 0 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_EFT_ENVM_ECC_OVRD                  BIT(28)                                             /*!< effective option byte ENVM ECC override enable status bit */
#define NVMC_OBSTAT0_EFT_IOSPDOPEN                      BIT(29)                                             /*!< effective option byte I/O speed optimization, high-speed at low-voltage enable status bit */
#define NVMC_OBSTAT0_EFT_NOPIPE_MODE                    BIT(30)                                             /*!< effective option byte pipeline mode bit */
#define NVMC_OBSTAT0_EFT_VFIMG                          BIT(31)                                             /*!< effective option byte Firmware image verification enable bit */

