wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_OBSTAT0_MDF */
#define NVMC_OBSTAT0_MDF_DISLFI                         BIT(0)                                              /*!< modified option byte Licensed firmware install (LFI) disable bit */
#define NVMC_OBSTAT0_MDF_NOPRINT                        BIT(1)                                              /*!< modified option byte no information is printed during secure boot */
#define NVMC_OBSTAT0_MDF_BOR_TH                         BITS(2,3)                                           /*!< modified option byte brownout reset threshold value */
#define NVMC_OBSTAT0_MDF_NWDG_HW                        BIT(4)                                              /*!< modified option byte watchdog value */
#define NVMC_OBSTAT0_MDF_VFALL                          BIT(5)                                              /*!< modified option byte Firmware image verification enable bit */
#define NVMC_OBSTAT0_MDF_NRST_DPSLP                     BIT(6)                                              /*!< modified option byte deepsleep reset value */
#define NVMC_OBSTAT0_MDF_NRST_STDBY                     BIT(7)                                              /*!< modified option byte standby reset value */
#define NVMC_OBSTAT0_MDF_SPC                            BITS(8,15)                                          /*!< modified option byte security protection code */
#define NVMC_OBSTAT0_MDF_OTA_CHECK                      BIT(16)                                             /*!< modified option byte OTA check status bit */
#define NVMC_OBSTAT0_MDF_FWDGSPD_DPSLP                  BIT(17)                                             /*!< modified option byte watchdog suspend status in deepsleep mode */
#define NVMC_OBSTAT0_MDF_FWDGSPD_STDBY                  BIT(18)                                             /*!< modified option byte watchdog suspend status in standby mode */
#define NVMC_OBSTAT0_MDF_FW_UPDATE                      BIT(19)                                             /*!< modified option byte Firmware update status bit */
#define NVMC_OBSTAT0_MDF_SWAP                           BIT(20)                                             /*!< modified option byte SWAP status bit */
#define NVMC_OBSTAT0_MDF_SCR                            BIT(21)                                             /*!< modified option byte security access mode status bit */
#define NVMC_OBSTAT0_MDF_ITCMECCEN                      BIT(22)                                             /*!< modified option byte ITCM ECC function enable status bit */
#define NVMC_OBSTAT0_MDF_DTCM0ECCEN                     BIT(23)                                             /*!< modified option byte DTCM0 ECC function enable status bit */
#define NVMC_OBSTAT0_MDF_DTCM1ECCEN                     BIT(24)                                             /*!< modified option byte DTCM1 ECC function enable status bit */
#define NVMC_OBSTAT0_MDF_R2_SRAM_ECCEN                  BIT(25)                                             /*!< modified option byte Region 2 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_MDF_R1_SRAM_ECCEN                  BIT(26)                                             /*!< modified option byte Region 1 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_MDF_R0_SRAM_ECCEN                  BIT(27)                                             /*!< modified option byte Region 0 SRAM ECC enable status bit */
#define NVMC_OBSTAT0_MDF_ENVM_ECC_OVRD                  BIT(28)                                             /*!< modified option byte ENVM ECC override enable status bit */
#define NVMC_OBSTAT0_MDF_IOSPDOPEN                      BIT(29)                                             /*!< modified option byte I/O speed optimization status bit */
#define NVMC_OBSTAT0_MDF_NOPIPE_MODE                    BIT(30)                                             /*!< modified option byte pipeline mode bit */
#define NVMC_OBSTAT0_MDF_VFIMG                          BIT(31)                                             /*!< modified option byte Firmware image verification enable bit */

/* NVMC_DCRPADDR_EFT */
#define NVMC_DCRPADDR_EFT_DCRP_AREA_START               BITS(0,8)                                           /*!< effective option byte DCRP area start address status bits */
#define NVMC_DCRPADDR_EFT_FLB1_DCRP_EN                  BIT(13)                                             /*!< effective option byte Flash bank1 region DCRP function enable status bits */
#define NVMC_DCRPADDR_EFT_FLB0_DCRP_EN                  BIT(14)                                             /*!< effective option byte Flash bank0 region DCRP function enable status bits */
#define NVMC_DCRPADDR_EFT_ENVM_DCRP_EN                  BIT(15)                                             /*!< effective option byte ENVM region DCRP function enable status bits */
#define NVMC_DCRPADDR_EFT_DCRP_AREA_END                 BITS(16,24)                                         /*!< effective option byte DCRP area end address status bits */
#define NVMC_DCRPADDR_EFT_FLB1_DCRP_EREN                BIT(29)                                             /*!< effective option byte Flash bank1 DCRP area erase enable status bit */
#define NVMC_DCRPADDR_EFT_FLB0_DCRP_EREN                BIT(30)                                             /*!< effective option byte Flash bank0 DCRP area erase enable status bit */
#define NVMC_DCRPADDR_EFT_ENVM_DCRP_EREN                BIT(31)                                             /*!< effective option byte ENVM DCRP area erase enable status bit */

/* NVMC_DCRPADDR_MDF */
#define NVMC_DCRPADDR_MDF_DCRP_AREA_START               BITS(0,8)                                           /*!< modified option byte DCRP area start address status bits */
#define NVMC_DCRPADDR_MDF_FLB1_DCRP_EN                  BIT(13)                                             /*!< modified option byte Flash bank1 region DCRP function enable status bits */
#define NVMC_DCRPADDR_MDF_FLB0_DCRP_EN                  BIT(14)                                             /*!< modified option byte Flash bank0 region DCRP function enable status bits */
#define NVMC_DCRPADDR_MDF_ENVM_DCRP_EN                  BIT(15)                                             /*!< modified option byte ENVM region DCRP function enable status bits */
#define NVMC_DCRPADDR_MDF_DCRP_AREA_END                 BITS(16,24)                                         /*!< modified option byte DCRP area end address status bits */
#define NVMC_DCRPADDR_MDF_FLB1_DCRP_EREN                BIT(29)                                             /*!< modified option byte Flash bank1 DCRP area erase enable status bit */
#define NVMC_DCRPADDR_MDF_FLB0_DCRP_EREN                BIT(30)                                             /*!< modified option byte Flash bank0 DCRP area erase enable status bit */
#define NVMC_DCRPADDR_MDF_ENVM_DCRP_EREN                BIT(31)                                             /*!< modified option byte ENVM DCRP area erase enable status bit */

