wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_SCRADDR_EFT */
#define NVMC_SCRADDR_EFT_SCR_AREA_START                 BITS(0,8)                                           /*!< effective option byte secure area start status bits */
#define NVMC_SCRADDR_EFT_FLB1_SCR_EN                    BIT(13)                                             /*!< effective option byte Flash bank1 region SCR function enable status bits */
#define NVMC_SCRADDR_EFT_FLB0_SCR_EN                    BIT(14)                                             /*!< effective option byte Flash bank0 region SCR function enable status bits */
#define NVMC_SCRADDR_EFT_ENVM_SCR_EN                    BIT(15)                                             /*!< effective option byte ENVM region SCR function enable status bits */
#define NVMC_SCRADDR_EFT_SCR_AREA_END                   BITS(16,24)                                         /*!< effective option byte secure area end status bits */
#define NVMC_SCRADDR_EFT_FLB1_SCR_EREN                  BIT(29)                                             /*!< effective option byte Flash bank1 secure area erase enable status bit */
#define NVMC_SCRADDR_EFT_FLB0_SCR_EREN                  BIT(30)                                             /*!< effective option byte Flash bank0 secure area erase enable status bit */
#define NVMC_SCRADDR_EFT_ENVM_SCR_EREN                  BIT(31)                                             /*!< effective option byte ENVM secure area erase enable status bit */

/* NVMC_SCRADDR_MDF */
#define NVMC_SCRADDR_MDF_SCR_AREA_START                 BITS(0,8)                                           /*!< modified option byte secure area start status bits */
#define NVMC_SCRADDR_MDF_FLB1_SCR_EN                    BIT(13)                                             /*!< modified option byte Flash bank1 region SCR function enable status bits */
#define NVMC_SCRADDR_MDF_FLB0_SCR_EN                    BIT(14)                                             /*!< modified option byte Flash bank0 region SCR function enable status bits */
#define NVMC_SCRADDR_MDF_ENVM_SCR_EN                    BIT(15)                                             /*!< modified option byte ENVM region SCR function enable status bits */
#define NVMC_SCRADDR_MDF_SCR_AREA_END                   BITS(16,24)                                         /*!< modified option byte secure area end status bits */
#define NVMC_SCRADDR_MDF_FLB1_SCR_EREN                  BIT(29)                                             /*!< modified option byte Flash bank1 secure area erase enable status bit */
#define NVMC_SCRADDR_MDF_FLB0_SCR_EREN                  BIT(30)                                             /*!< modified option byte Flash bank0 secure area erase enable status bit */
#define NVMC_SCRADDR_MDF_ENVM_SCR_EREN                  BIT(31)                                             /*!< modified option byte ENVM secure area erase enable status bit */

/* NVMC_BTADDR_EFT */
#define NVMC_BTADDR_EFT_BOOT_ADDR0                      BITS(0,15)                                          /*!< effective option byte boot address 0 */
#define NVMC_BTADDR_EFT_BOOT_ADDR1                      BITS(16,31)                                         /*!< effective option byte boot address 1 */

/* NVMC_BTADDR_MDF */
#define NVMC_BTADDR_MDF_BOOT_ADDR0                      BITS(0,15)                                          /*!< modified option byte boot address 0 */
#define NVMC_BTADDR_MDF_BOOT_ADDR1                      BITS(16,31)                                         /*!< modified option byte boot address 1 */

/* NVMC_OBSTAT1_EFT */
#define NVMC_OBSTAT1_EFT_ITCM_AXI_SHARED                BITS(0,2)                                           /*!< effective option byte ITCM and AXI RAM sharing status bit */
#define NVMC_OBSTAT1_EFT_ITCM_DTCM_SHARED               BITS(4,6)                                           /*!< effective option byte ITCM and DTCM RAM sharing status bit */
#define NVMC_OBSTAT1_EFT_DATA                           BITS(16,30)                                         /*!< effective option byte User defined option byte data status value */
#define NVMC_OBSTAT1_EFT_CPUBUSTO                       BIT(31)                                             /*!< effective option byte CPU bus timeout status bit */

/* NVMC_OBSTAT1_MDF */
#define NVMC_OBSTAT1_MDF_ITCM_AXI_SHARED                BITS(0,2)                                           /*!< modified option byte ITCM and AXI RAM sharing status bit */
#define NVMC_OBSTAT1_MDF_ITCM_DTCM_SHARED               BITS(4,6)                                           /*!< modified option byte ITCM and DTCM RAM sharing status bit */
#define NVMC_OBSTAT1_MDF_DATA                           BITS(16,30)                                         /*!< modified option byte User defined option byte data status value */
#define NVMC_OBSTAT1_MDF_CPUBUSTO                       BIT(31)                                             /*!< modified option byte CPU bus timeout status bit */

#if defined(NVM_VER_CASE2)
/* case2: 3.5MB flash memory and 2MB ENVM */
/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_EFT_WP                             BITS(0,15)                                          /*!< effective option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_MDF_WP                             BITS(0,15)                                          /*!< modified option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP0_FLASH_EFT */
#define NVMC_WP0_FLASH_EFT_WP                           BITS(0,27)                                          /*!< effective option byte Flash sector erase / program protection option status bit */

/* NVMC_WP0_FLASH_MDF */
#define NVMC_WP0_FLASH_MDF_WP                           BITS(0,27)                                          /*!< modified option byte Flash sector erase / program protection option status bit */

#elif defined(NVM_VER_CASE3)
/* case3: 3.5MB flash memory and 1MB ENVM */
/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_EFT_WP                             BITS(0,7)                                           /*!< effective option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_MDF_WP                             BITS(0,7)                                           /*!< modified option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP0_FLASH_EFT */
#define NVMC_WP0_FLASH_EFT_WP                           BITS(0,27)                                          /*!< effective option byte Flash sector erase / program protection option status bit */

/* NVMC_WP0_FLASH_MDF */
#define NVMC_WP0_FLASH_MDF_WP                           BITS(0,27)                                          /*!< modified option byte Flash sector erase / program protection option status bit */

#elif defined(NVM_VER_CASE4)
/* case4: 0MB flash memory and 1.625MB ENVM */
/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_EFT_WP                             BITS(0,12)                                          /*!< effective option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_MDF_WP                             BITS(0,12)                                          /*!< modified option byte ENVM sector erase/program protection option status bit */

#else
/* case1: 7.5MB flash memory and 2MB ENVM */
/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_EFT_WP                             BITS(0,15)                                          /*!< effective option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP_ENVM_EFT */
#define NVMC_WP_ENVM_MDF_WP                             BITS(0,15)                                          /*!< modified option byte ENVM sector erase/program protection option status bit */

/* NVMC_WP0_FLASH_EFT */
#define NVMC_WP0_FLASH_EFT_WP                           BITS(0,31)                                          /*!< effective option byte Flash sector erase / program protection option status bit */

/* NVMC_WP0_FLASH_MDF */
#define NVMC_WP0_FLASH_MDF_WP                           BITS(0,31)                                          /*!< modified option byte Flash sector erase / program protection option status bit */

/* NVMC_WP1_FLASH_EFT */
#define NVMC_WP1_FLASH_EFT_WP                           BITS(0,27)                                          /*!< effective option byte Flash sector erase / program protection option status bit */

