wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_WP1_FLASH_MDF */
#define NVMC_WP1_FLASH_MDF_WP                           BITS(0,27)                                          /*!< modified option byte Flash sector erase / program protection option status bit */
#endif /* NVM_VER_CASEx */

/* NVMC_OBREPCTL_EFT */
#define NVMC_OBREPCTL_EFT_SYNEN                         BIT(0)                                              /*!< effective option byte The synchronization mode enable status bit */
#define NVMC_OBREPCTL_EFT_HWREPMOD                      BIT(1)                                              /*!< effective option byte Hardware self-check mode status bit */
#define NVMC_OBREPCTL_EFT_BLREPMOD                      BIT(2)                                              /*!< effective option byte Bootloader self-check mode status bit */
#define NVMC_OBREPCTL_EFT_ERR1REPEN                     BIT(3)                                              /*!< effective option byte One bit error repair in self-repair function status bit */
#define NVMC_OBREPCTL_EFT_ERR2REPEN                     BIT(4)                                              /*!< effective option byte Two bit error repair in self-repair function status bit */
#define NVMC_OBREPCTL_EFT_BBREPLEN                      BIT(5)                                              /*!< effective option byte Bad block address replace status bit */
#define NVMC_OBREPCTL_EFT_ERR1AUTOREPEN                 BIT(6)                                              /*!< effective option byte 1 bit error automatic repair enable status bit */
#define NVMC_OBREPCTL_EFT_ERR2AUTOREPEN                 BIT(7)                                              /*!< effective option byte 2 bits error automatic repair enable status bit */
#define NVMC_OBREPCTL_EFT_SYNSZ                         BITS(8,12)                                          /*!< effective option byte Option Byte synchronize size status bit */
#define NVMC_OBREPCTL_EFT_BBMODE                        BIT(13)                                             /*!< effective option byte Mode of determining whether the repair is successful after the repair bit */
#define NVMC_OBREPCTL_EFT_SYSRSTREPDIS                  BIT(14)                                             /*!< effective option byte The system reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_EFT_PORRSTREPDIS                  BIT(15)                                             /*!< effective option byte The power-on reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_EFT_ERR1CNTTH                     BITS(16,20)                                         /*!< effective option byte One bit error not repaired counter interrupt threshold bits */
#define NVMC_OBREPCTL_EFT_ERR2CNTTH                     BITS(21,25)                                         /*!< effective option byte Two bit error not repaired counter interrupt threshold bits */
#define NVMC_OBREPCTL_EFT_COPYSZ                        BITS(26,31)                                         /*!< effective option byte copy size during OTA upgrade */

/* NVMC_OBREPCTL_MDF */
#define NVMC_OBREPCTL_MDF_SYNEN                         BIT(0)                                              /*!< modified option byte The synchronization mode enable status bit */
#define NVMC_OBREPCTL_MDF_HWREPMOD                      BIT(1)                                              /*!< modified option byte Hardware self-check mode status bit */
#define NVMC_OBREPCTL_MDF_BLREPMOD                      BIT(2)                                              /*!< modified option byte Bootloader self-check mode status bit */
#define NVMC_OBREPCTL_MDF_ERR1REPEN                     BIT(3)                                              /*!< modified option byte One bit error repair enable status bit */
#define NVMC_OBREPCTL_MDF_ERR2REPEN                     BIT(4)                                              /*!< modified option byte Two bit error repair enable status bit */
#define NVMC_OBREPCTL_MDF_BBREPLEN                      BIT(5)                                              /*!< modified option byte Bad block address replace status bit */
#define NVMC_OBREPCTL_MDF_ERR1AUTOREPEN                 BIT(6)                                              /*!< modified option byte 1 bit error automatic repair enable status bit */
#define NVMC_OBREPCTL_MDF_ERR2AUTOREPEN                 BIT(7)                                              /*!< modified option byte 2 bits error automatic repair enable status bit */
#define NVMC_OBREPCTL_MDF_SYNSZ                         BITS(8,12)                                          /*!< modified option byte Option Byte synchronize size bit */
#define NVMC_OBREPCTL_MDF_BBMODE                        BIT(13)                                             /*!< modified option byte Mode of determining whether the repair is successful after the repair bit */
#define NVMC_OBREPCTL_MDF_SYSRSTREPDIS                  BIT(14)                                             /*!< modified option byte The system reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_MDF_PORRSTREPDIS                  BIT(15)                                             /*!< modified option byte The power-on reset self-check repair function enable status bit */
#define NVMC_OBREPCTL_MDF_ERR1CNTTH                     BITS(16,20)                                         /*!< modified option byte One bit error not repaired counter interrupt threshold bits */
#define NVMC_OBREPCTL_MDF_ERR2CNTTH                     BITS(21,25)                                         /*!< modified option byte Two bit error not repaired counter interrupt threshold bits */
#define NVMC_OBREPCTL_MDF_COPYSZ                        BITS(26,31)                                         /*!< modified option byte copy size during OTA upgrade */

/* NVMC_OBREPSTADDR_EFT */
#define NVMC_OBREPSTADDR_EFT_STARTADDR                  BITS(5,20)                                          /*!< effective option byte Self-check repair start offset address status bit */

/* NVMC_OBREPENDADDR_EFT */
#define NVMC_OBREPENDADDR_EFT_ENDADDR                   BITS(5,20)                                          /*!< effective option byte Self-check repair end offset address status bit */

/* NVMC_OBREPSTADDR_MDF */
#define NVMC_OBREPSTADDR_MDF_STARTADDR                  BITS(5,20)                                          /*!< modified option byte Self-check repair start offset address status bit */

/* NVMC_OBREPENDADDR_EFT */
#define NVMC_OBREPENDADDR_MDF_ENDADDR                   BITS(5,20)                                          /*!< modified option byte Self-check repair end offset address status bit */

/* NVMC_OBBBADDRX_EFT */
#define NVMC_OBBBADDRX_EFT_OBBBADDRVLD                  BIT(0)                                              /*!< effective option byte The bad block address recorded by the option byte valid status bit */
#define NVMC_OBBBADDRX_EFT_OBBBADDR                     BITS(5,20)                                          /*!< effective option byte Bad block address bit */

/* NVMC_OBBBADDRX_MDF */
#define NVMC_OBBBADDRX_MDF_OBBBADDRVLD                  BIT(0)                                              /*!< modified option byte The bad block address recorded by the option byte valid status bit */
#define NVMC_OBBBADDRX_MDF_OBBBADDR                     BITS(5,20)                                          /*!< modified option byte Bad block address status bit */

/* NVMC_BLANKADDR */
#define NVMC_BLANKADDR_FLBLANKADDR                      BITS(5,20)                                          /*!< flash backup blank address */

/* NVMC_PID0 */
#define NVMC_PID0_PID                                   BITS(0,31)                                          /*!< product ID 0 */

