wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_PID1 */
#define NVMC_PID1_PID                                   BITS(0,31)                                          /*!< product ID 1 */

/* NVMC_NMIERRADDR */
#define NVMC_NMIERRADDR_NMIERRADDR                      BITS(5,20)                                          /*!< AXI read with uncorrectable error interrupt address */

/* OTP bits definitions */
/* NVMC_OTP_CTL */
#define NVMC_OTP_CTL_AES_KEY_CRC                        BITS(24,31)                                         /*!< 8-bits CRC calculation result value of AES key bits */
#define NVMC_OTP_CTL_OTP_REPSTART                       BIT(16)                                             /*!< OTP repair start signal */
#define NVMC_OTP_CTL_DP_CRC                             BITS(8,15)                                          /*!< 8-bits CRC calculation result value of debug password data */
#define NVMC_OTP_CTL_ENDIE                              BIT(4)                                              /*!< OTP program/repair end flag interrupt enable */
#define NVMC_OTP_CTL_PGSERRIE                           BIT(3)                                              /*!< OTP program sequence error interrupt enable bit */
#define NVMC_OTP_CTL_MULTI_DATAERRIE                    BIT(2)                                              /*!< OTP Multi-redundant data error interrupt enable bit */
#define NVMC_OTP_CTL_DATAERRIE                          BIT(1)                                              /*!< OTP data error interrupt enable bit */
#define NVMC_OTP_CTL_PGLKERRIE                          BIT(0)                                              /*!< OTP program at lock state error interrupt enable bit */

/* NVMC_OTP_STAT */
#define NVMC_OTP_STAT_PGLKERR_ADDR                      BITS(16,28)                                         /*!< low 13 bits of the logical address corresponding to the PGLKERRF */
#define NVMC_OTP_STAT_BUSY                              BIT(5)                                              /*!< OTP busy flag */
#define NVMC_OTP_STAT_ENDF                              BIT(4)                                              /*!< OTP program/repair end flag */
#define NVMC_OTP_STAT_PGSERR                            BIT(3)                                              /*!< OTP program sequence error flag */
#define NVMC_OTP_STAT_MULTI_DATAERRF                    BIT(2)                                              /*!< OTP Multi-redundant data error flag */
#define NVMC_OTP_STAT_DATAERRF                          BIT(1)                                              /*!< OTP Data error flag */
#define NVMC_OTP_STAT_PGLKERRF                          BIT(0)                                              /*!< OTP Program at lock state error flag */

/* NVMC_OTP_USER_CTL0 */
#define NVMC_OTP_USER_CTL0_DCRP_EFFCTL_LK               BIT(31)                                             /*!< DCRP_EFFCTL lock bit */
#define NVMC_OTP_USER_CTL0_SCR_EFFCTL_LK                BIT(30)                                             /*!< SCR_EFFCTL lock bit */
#define NVMC_OTP_USER_CTL0_SCR_LK                       BIT(29)                                             /*!< SCR lock bit */
#define NVMC_OTP_USER_CTL0_SPC_H_LK                     BIT(28)                                             /*!< SPC_H lock bit */
#define NVMC_OTP_USER_CTL0_SPC_L_LK                     BIT(27)                                             /*!< SPC_L lock bit */
#define NVMC_OTP_USER_CTL0_JTAGNSW_LK                   BIT(26)                                             /*!< JTAGNSW lock bit */
#define NVMC_OTP_USER_CTL0_NDBG_LK                      BITS(24,25)                                         /*!< NDBG lock bit */
#define NVMC_OTP_USER_CTL0_DCRP_EFFCTL                  BIT(23)                                             /*!< DCRP area effective control bit */
#define NVMC_OTP_USER_CTL0_SCR_EFFCTL                   BIT(22)                                             /*!< SCR area effective control bit */
#define NVMC_OTP_USER_CTL0_SCR                          BIT(21)                                             /*!< secure mode enable */
#define NVMC_OTP_USER_CTL0_SPC_H                        BIT(20)                                             /*!< configure security protection to level high */
#define NVMC_OTP_USER_CTL0_SPC_L                        BIT(19)                                             /*!< configure security protection to level low */
#define NVMC_OTP_USER_CTL0_JTAGNSW                      BIT(18)                                             /*!< SW or JTAG debugger select */
#define NVMC_OTP_USER_CTL0_NDBG                         BITS(16,17)                                         /*!< debugging permission setting */
#define NVMC_OTP_USER_CTL0_VFALL_LK                     BIT(10)                                             /*!< VFALL lock bit */
#define NVMC_OTP_USER_CTL0_VFIMG_LK                     BIT(9)                                              /*!< VFIMG lock bit */
#define NVMC_OTP_USER_CTL0_DISLFI_LK                    BIT(8)                                              /*!< DISLFI lock bit */
#define NVMC_OTP_USER_CTL0_VFALL                        BIT(2)                                              /*!< firmware image (Image must contain a certificate) verification enable bit */
#define NVMC_OTP_USER_CTL0_VFIMG                        BIT(1)                                              /*!< firmware image verification enable bit */
#define NVMC_OTP_USER_CTL0_DISLFI                       BIT(0)                                              /*!< licensed firmware install (LFI) disable */

/* NVMC_OTP_USER_CTL1 */
#define NVMC_OTP_USER_CTL1_FLBAK_DISABLE_LK             BIT(14)                                             /*!< FLBAK_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_BBREPL_DISABLE_LK            BIT(13)                                             /*!< BBREPL_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_SWAP_DISABLE_LK              BIT(12)                                             /*!< SWAP_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_SYN_MODE_LOCK_LK             BIT(11)                                             /*!< SYN_MODE_LOCK lock bit */
#define NVMC_OTP_USER_CTL1_SYN_EN_LK                    BIT(10)                                             /*!< SYN_EN lock bit */
#define NVMC_OTP_USER_CTL1_REPAIR_DISABLE_LK            BIT(9)                                              /*!< REPAIR_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_COPY_DISABLE_LK              BIT(8)                                              /*!< COPY_DISABLE lock bit */
#define NVMC_OTP_USER_CTL1_FLBAK_DISABLE                BIT(6)                                              /*!< Disable the flash backup function */
#define NVMC_OTP_USER_CTL1_BBREPL_DISABLE               BIT(5)                                              /*!< Force disable the bad block replacement function */
#define NVMC_OTP_USER_CTL1_SWAP_DISABLE                 BIT(4)                                              /*!< Disable the backup area swap function */
#define NVMC_OTP_USER_CTL1_SYN_MODE_LOCK                BIT(3)                                              /*!< Lock the current synchronization mode configuration */
#define NVMC_OTP_USER_CTL1_SYN_EN                       BIT(2)                                              /*!< Force enable the synchronization mode */
#define NVMC_OTP_USER_CTL1_REPAIR_DISABLE               BIT(1)                                              /*!< Disable self-check and repair function */
#define NVMC_OTP_USER_CTL1_COPY_DISABLE                 BIT(0)                                              /*!< Disable OTA upgrade copy function */

