wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* NVMC_OTP_USER_CTL2 */
#define NVMC_OTP_USER_CTL2_SCR_AREA_END                 BITS(16,24)                                         /*!< secure user area end address bits */
#define NVMC_OTP_USER_CTL2_ENVM_SCR_EN                  BIT(15)                                             /*!< ENVM region SCR function enable configuration bits */
#define NVMC_OTP_USER_CTL2_FLB0_SCR_EN                  BIT(14)                                             /*!< flash bank0 region SCR function enable configuration bits */
#define NVMC_OTP_USER_CTL2_FLB1_SCR_EN                  BIT(13)                                             /*!< flash bank1 region SCR function enable configuration bits */
#define NVMC_OTP_USER_CTL2_SCR_AREA_START               BITS(0,8)                                           /*!< secure user area start address bits */

/* NVMC_OTP_USER_CTL3 */
#define NVMC_OTP_USER_CTL3_DCRP_AREA_END                BITS(16,24)                                         /*!< DCRP area end address bits */
#define NVMC_OTP_USER_CTL3_ENVM_DCRP_EN                 BIT(15)                                             /*!< ENVM region DCRP function enable status bits */
#define NVMC_OTP_USER_CTL3_FLB0_DCRP_EN                 BIT(14)                                             /*!< flash bank0 region DCRP function enable status bits */
#define NVMC_OTP_USER_CTL3_FLB1_DCRP_EN                 BIT(13)                                             /*!< flash bank1 region DCRP function enable status bits */
#define NVMC_OTP_USER_CTL3_DCRP_AREA_START              BITS(0,8)                                           /*!< DCRP area start address bits */

/* NVMC_OTP_USER_CTL4 */
#define NVMC_OTP_USER_CTL4_ENVM_DCRP_ENLK               BIT(12)                                             /*!< ENVM_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define NVMC_OTP_USER_CTL4_FLB0_DCRP_ENLK               BIT(11)                                             /*!< FLB0_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define NVMC_OTP_USER_CTL4_FLB1_DCRP_ENLK               BIT(10)                                             /*!< FLB1_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define NVMC_OTP_USER_CTL4_ENVM_SCR_ENLK                BIT(6)                                              /*!< ENVM_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define NVMC_OTP_USER_CTL4_FLB0_SCR_ENLK                BIT(5)                                              /*!< FLB0_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define NVMC_OTP_USER_CTL4_FLB1_SCR_ENLK                BIT(4)                                              /*!< FLB1_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define NVMC_OTP_USER_CTL4_AES_KEY_ON                   BIT(3)                                              /*!< lock OTP_AES_KEY register and enable AES decrypt function */
#define NVMC_OTP_USER_CTL4_DCRP_AREALK                  BIT(2)                                              /*!< DCRP area address lock bit */
#define NVMC_OTP_USER_CTL4_SCR_AREALK                   BIT(1)                                              /*!< Secure user area address lock bit */
#define NVMC_OTP_USER_CTL4_DPLK                         BIT(0)                                              /*!< DBGPSWD_DATA lock bit */

/* NVMC_OTP_USER_CTL5 */
#define NVMC_OTP_USER_CTL5_DUMMY1_LK                    BITS(24,31)                                         /*!< DUMMY1 lock bit */
#define NVMC_OTP_USER_CTL5_DUMMY1                       BITS(16,23)                                         /*!< reserve space for other operations */
#define NVMC_OTP_USER_CTL5_DUMMY0_LK                    BITS(8,15)                                          /*!< DUMMY0 lock bit */
#define NVMC_OTP_USER_CTL5_DUMMY0                       BITS(0,7)                                           /*!< reserve space for other operations */

/* OTP AXI program NVMC_OTP_USER_CTL0 related parameters */
#define OTP_AXI_PROGRAM_DATA_DCRP_EFFCTL_LK             BIT(15)                                             /*!< DCRP_EFFCTL lock bit */
#define OTP_AXI_PROGRAM_DATA_SCR_EFFCTL_LK              BIT(14)                                             /*!< SCR_EFFCTL lock bit */
#define OTP_AXI_PROGRAM_DATA_SCR_LK                     BIT(13)                                             /*!< SCR lock bit */
#define OTP_AXI_PROGRAM_DATA_SPC_H_LK                   BIT(12)                                             /*!< SPC_H lock bit */
#define OTP_AXI_PROGRAM_DATA_SPC_L_LK                   BIT(11)                                             /*!< SPC_L lock bit */
#define OTP_AXI_PROGRAM_DATA_JTAGNSW_LK                 BIT(10)                                             /*!< JTAGNSW lock bit */
#define OTP_AXI_PROGRAM_DATA_NDBG_LK                    BITS(8,9)                                           /*!< NDBG lock bit */
#define OTP_AXI_PROGRAM_DATA_DCRP_EFFCTL                BIT(7)                                              /*!< DCRP area effective control bit */
#define OTP_AXI_PROGRAM_DATA_SCR_EFFCTL                 BIT(6)                                              /*!< SCR area effective control bit */
#define OTP_AXI_PROGRAM_DATA_SCR                        BIT(5)                                              /*!< secure mode enable */
#define OTP_AXI_PROGRAM_DATA_SPC_H                      BIT(4)                                              /*!< configure security protection to level high */
#define OTP_AXI_PROGRAM_DATA_SPC_L                      BIT(3)                                              /*!< configure security protection to level low */
#define OTP_AXI_PROGRAM_DATA_JTAGNSW                    BIT(2)                                              /*!< SW or JTAG debugger select */
#define OTP_AXI_PROGRAM_DATA_NDBG                       BITS(0,1)                                           /*!< debugging permission setting */
#define OTP_AXI_PROGRAM_DATA_VFALL_LK                   BIT(10)                                             /*!< VFALL lock bit  */
#define OTP_AXI_PROGRAM_DATA_VFIMG_LK                   BIT(9)                                              /*!< VFIMG lock bit */
#define OTP_AXI_PROGRAM_DATA_DISLFI_LK                  BIT(8)                                              /*!< DISLFI lock bit */
#define OTP_AXI_PROGRAM_DATA_VFALL                      BIT(2)                                              /*!< Firmware image verification enable bit  */
#define OTP_AXI_PROGRAM_DATA_VFIMG                      BIT(1)                                              /*!< firmware image verification enable bit */
#define OTP_AXI_PROGRAM_DATA_DISLFI                     BIT(0)                                              /*!< licensed firmware install (LFI) disable */

/* OTP AXI program NVMC_OTP_USER_CTL1 related parameters */
#define OTP_AXI_PROGRAM_DATA_BBREPL_DISABLE_LK          BIT(13)                                             /*!< BBREPL_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_SWAP_DISABLE_LK            BIT(12)                                             /*!< SWAP_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_SYN_MODE_LOCK_LK           BIT(11)                                             /*!< SYN_MODE_LOCK lock bit */
#define OTP_AXI_PROGRAM_DATA_SYN_EN_LK                  BIT(10)                                             /*!< SYN_EN lock bit */
#define OTP_AXI_PROGRAM_DATA_REPAIR_DISABLE_LK          BIT(9)                                              /*!< REPAIR_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_COPY_DISABLE_LK            BIT(8)                                              /*!< COPY_DISABLE lock bit */
#define OTP_AXI_PROGRAM_DATA_BBREPL_DISABLE             BIT(5)                                              /*!< Force disable the bad block replacement function */
#define OTP_AXI_PROGRAM_DATA_SWAP_DISABLE               BIT(4)                                              /*!< Disable the backup area swap function */
#define OTP_AXI_PROGRAM_DATA_SYN_MODE_LOCK              BIT(3)                                              /*!< Lock the current synchronization mode configuration */
#define OTP_AXI_PROGRAM_DATA_SYN_EN                     BIT(2)                                              /*!< Force enable the synchronization mode */
#define OTP_AXI_PROGRAM_DATA_REPAIR_DISABLE             BIT(1)                                              /*!< Disable self-check and repair function */
#define OTP_AXI_PROGRAM_DATA_COPY_DISABLE               BIT(0)                                              /*!< Disable OTA upgrade copy function */

/* OTP AXI program NVMC_OTP_USER_CTL2 related parameters */
#define OTP_AXI_PROGRAM_DATA_SCR_AREA_END               BITS(0,8)                                           /*!< secure user area end address bits */
#define OTP_AXI_PROGRAM_DATA_ENVM_SCR_EN                BIT(15)                                             /*!< ENVM region SCR function enable configuration bits */
#define OTP_AXI_PROGRAM_DATA_FLB0_SCR_EN                BIT(14)                                             /*!< flash bank0 region SCR function enable configuration bits */
#define OTP_AXI_PROGRAM_DATA_FLB1_SCR_EN                BIT(13)                                             /*!< flash bank1 region SCR function enable configuration bits */
#define OTP_AXI_PROGRAM_DATA_SCR_AREA_START             BITS(0,8)                                           /*!< secure user area start address bits */

/* OTP AXI program NVMC_OTP_USER_CTL3 related parameters */
#define OTP_AXI_PROGRAM_DATA_DCRP_AREA_END              BITS(0,8)                                           /*!< DCRP area end address bits */
#define OTP_AXI_PROGRAM_DATA_ENVM_DCRP_EN               BIT(15)                                             /*!< ENVM region DCRP function enable status bits */
#define OTP_AXI_PROGRAM_DATA_FLB0_DCRP_EN               BIT(14)                                             /*!< flash bank0 region DCRP function enable status bits */
#define OTP_AXI_PROGRAM_DATA_FLB1_DCRP_EN               BIT(13)                                             /*!< flash bank1 region DCRP function enable status bits */
#define OTP_AXI_PROGRAM_DATA_DCRP_AREA_START            BITS(0,8)                                           /*!< DCRP area start address bits */

/* OTP AXI program NVMC_OTP_USER_CTL4 related parameters */
#define OTP_AXI_PROGRAM_DATA_ENVM_DCRP_ENLK             BIT(12)                                             /*!< ENVM_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define OTP_AXI_PROGRAM_DATA_FLB0_DCRP_ENLK             BIT(11)                                             /*!< FLB0_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define OTP_AXI_PROGRAM_DATA_FLB1_DCRP_ENLK             BIT(10)                                             /*!< FLB1_DCRP_EN of NVMC_OTP_USER_CTL2 register lock bit */
#define OTP_AXI_PROGRAM_DATA_ENVM_SCR_ENLK              BIT(6)                                              /*!< ENVM_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define OTP_AXI_PROGRAM_DATA_FLB0_SCR_ENLK              BIT(5)                                              /*!< FLB0_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define OTP_AXI_PROGRAM_DATA_FLB1_SCR_ENLK              BIT(4)                                              /*!< FLB1_SCR_EN of NVMC_OTP_USER_CTL1 register lock bit */
#define OTP_AXI_PROGRAM_DATA_AES_KEY_ON                 BIT(3)                                              /*!< lock OTP_AES_KEY register and enable AES decrypt function */
#define OTP_AXI_PROGRAM_DATA_DCRP_AREALK                BIT(2)                                              /*!< DCRP area address lock bit */
#define OTP_AXI_PROGRAM_DATA_SCR_AREALK                 BIT(1)                                              /*!< Secure user area address lock bit */
#define OTP_AXI_PROGRAM_DATA_DPLK                       BIT(0)                                              /*!< DBGPSWD_DATA lock bit */

/* NVMC_OTP_USER_CTL5 */
#define OTP_AXI_PROGRAM_DATA_DUMMY1_LK                  BITS(8,15)                                          /*!< DUMMY1 lock bit */
#define OTP_AXI_PROGRAM_DATA_DUMMY1                     BITS(0,7)                                           /*!< reserve space for other operations */
#define OTP_AXI_PROGRAM_DATA_DUMMY0_LK                  BITS(8,15)                                          /*!< DUMMY0 lock bit */
#define OTP_AXI_PROGRAM_DATA_DUMMY0                     BITS(0,7)                                           /*!< reserve space for other operations */

/* unlock key */
#define UNLOCK_KEY0                                     ((uint32_t)0x45670123U)                             /*!< unlock key 0 */
#define UNLOCK_KEY1                                     ((uint32_t)0xCDEF89ABU)                             /*!< unlock key 1 */

#define OB_UNLOCK_KEY0                                  ((uint32_t)0x08192A3BU)                             /*!< option byte unlock key 0 */
#define OB_UNLOCK_KEY1                                  ((uint32_t)0x4C5D6E7FU)                             /*!< option byte unlock key 1 */

#define PFINJ_UNLOCK_KEY                                ((uint32_t)0xA55A55AAU)                             /*!< ENVM program fault inject unlock key */

/* FMC wait state counter value */
#define PERFCTL_WSCNT(regval)                           (BITS(0,3) & ((uint32_t)(regval) << 0))
#define PERFCTL_WSCNT_1                                 PERFCTL_WSCNT(1)                                    /*!< 1 wait state added */
#define PERFCTL_WSCNT_2                                 PERFCTL_WSCNT(2)                                    /*!< 2 wait state added */
#define PERFCTL_WSCNT_3                                 PERFCTL_WSCNT(3)                                    /*!< 3 wait state added */
#define PERFCTL_WSCNT_4                                 PERFCTL_WSCNT(4)                                    /*!< 4 wait state added */
#define PERFCTL_WSCNT_5                                 PERFCTL_WSCNT(5)                                    /*!< 5 wait state added */
#define PERFCTL_WSCNT_6                                 PERFCTL_WSCNT(6)                                    /*!< 6 wait state added */
#define PERFCTL_WSCNT_7                                 PERFCTL_WSCNT(7)                                    /*!< 7 wait state added */
#define PERFCTL_WSCNT_8                                 PERFCTL_WSCNT(8)                                    /*!< 8 wait state added */
#define PERFCTL_WSCNT_9                                 PERFCTL_WSCNT(9)                                    /*!< 9 wait state added */
#define PERFCTL_WSCNT_10                                PERFCTL_WSCNT(10)                                   /*!< 10 wait state added */
#define PERFCTL_WSCNT_11                                PERFCTL_WSCNT(11)                                   /*!< 11 wait state added */
#define PERFCTL_WSCNT_12                                PERFCTL_WSCNT(12)                                   /*!< 12 wait state added */
#define PERFCTL_WSCNT_13                                PERFCTL_WSCNT(13)                                   /*!< 13 wait state added */
#define PERFCTL_WSCNT_14                                PERFCTL_WSCNT(14)                                   /*!< 14 wait state added */
#define PERFCTL_WSCNT_15                                PERFCTL_WSCNT(15)                                   /*!< 15 wait state added */

/* Flash buffer prefetch control */
#define PERFCTL_FLASH_BUF_PFETCH(regval)                (BITS(22,23) & ((uint32_t)(regval) << 22U))
#define FLASH_NO_PREFETCH                               PERFCTL_FLASH_BUF_PFETCH(0)                         /*!< flash no prefetch  */
#define FLASH_PREFETCH_1_LINE                           PERFCTL_FLASH_BUF_PFETCH(1)                         /*!< flash prefetch 1 line */
#define FLASH_PREFETCH_3_LINE                           PERFCTL_FLASH_BUF_PFETCH(2)                         /*!< flash prefetch 3 line */

/* Flash program size */
#define PERFCTL_FLASH_PG_SZ(regval)                     (BITS(20,21) & ((uint32_t)(regval) << 20U))
#define FLASH_PROG_SIZE_8BYTES                          PERFCTL_FLASH_PG_SZ(0)                              /*!< flash program size is 8 bytes */
#define FLASH_PROG_SIZE_32BYTES                         PERFCTL_FLASH_PG_SZ(1)                              /*!< flash program size is 32 bytes */

/* ENVM general buffer size value */
#define PERFCTL_ENVM_GP_BUFSZ(regval)                   (BITS(18,19) & ((uint32_t)(regval) << 18U))
#define ENVM_GP_BUF_SIZE1                               PERFCTL_ENVM_GP_BUFSZ(0)                            /*!< ENVM general buffer size is 1x32 bytes */
#define ENVM_GP_BUF_SIZE2                               PERFCTL_ENVM_GP_BUFSZ(1)                            /*!< ENVM general buffer size is 2x32 bytes */
#define ENVM_GP_BUF_SIZE4                               PERFCTL_ENVM_GP_BUFSZ(2)                            /*!< ENVM general buffer size is 4x32 bytes */
#define ENVM_GP_BUF_SIZE8                               PERFCTL_ENVM_GP_BUFSZ(3)                            /*!< ENVM general buffer size is 8x32 bytes */

/* ENVM CPU buffer size value */
#define PERFCTL_ENVM_CPU_BUFSZ(regval)                  (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define ENVM_CPU_BUF_SIZE1                              PERFCTL_ENVM_CPU_BUFSZ(0)                           /*!< ENVM CPU buffer size is 1x32 bytes */
#define ENVM_CPU_BUF_SIZE2                              PERFCTL_ENVM_CPU_BUFSZ(1)                           /*!< ENVM CPU buffer size is 2x32 bytes */
#define ENVM_CPU_BUF_SIZE4                              PERFCTL_ENVM_CPU_BUFSZ(2)                           /*!< ENVM CPU buffer size is 4x32 bytes */
#define ENVM_CPU_BUF_SIZE8                              PERFCTL_ENVM_CPU_BUFSZ(3)                           /*!< ENVM CPU buffer size is 8x32 bytes */

