wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* flash DTR mode value */
#define PERFCTL_DTREN(regval)                           (BIT(15) & ((uint32_t)(regval) << 15U))
#define FLASH_DTR_MODE_ENABLE                           PERFCTL_DTREN(0)                                    /*!< Disable flash DTR mode */
#define FLASH_DTR_MODE_DISABLE                          PERFCTL_DTREN(1)                                    /*!< Enable flash DTR mode */

/* option byte Licensed firmware install configure */
#define OBSTAT0_DISLFI(regval)                          (BIT(0) & ((uint32_t)(regval) << 0U))
#define OB_LICENCE_FW_INSTALL_ENABLE                    OBSTAT0_DISLFI(0)                                   /*!< Enable licensed firmware install */
#define OB_LICENCE_FW_INSTALL_DISABLE                   OBSTAT0_DISLFI(1)                                   /*!< Disable licensed firmware install */

/* option byte information print configure */
#define OBSTAT0_NOPRINT(regval)                         (BIT(1) & ((uint32_t)(regval) << 1U))
#define OB_INFO_PRINT_DISABLE                           OBSTAT0_NOPRINT(0)                                  /*!< Disable information print during secure boot */
#define OB_INFO_PRINT_ENABLE                            OBSTAT0_NOPRINT(1)                                  /*!< Enable information print during secure boot */

/* option byte BOR threshold value */
#define OBSTAT0_BOR_TH(regval)                          (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define OB_BOR_TH_OFF                                   OBSTAT0_BOR_TH(0)                                   /*!< no BOR function */
#define OB_BOR_TH_VALUE1                                OBSTAT0_BOR_TH(1)                                   /*!< BOR threshold value 1 */
#define OB_BOR_TH_VALUE2                                OBSTAT0_BOR_TH(2)                                   /*!< BOR threshold value 2 */
#define OB_BOR_TH_VALUE3                                OBSTAT0_BOR_TH(3)                                   /*!< BOR threshold value 3 */

/* option byte software/hardware free watchdog timer */
#define OBSTAT0_NWDG_HW(regval)                         (BIT(4) & ((uint32_t)(regval) << 4U))
#define OB_FWDGT_HW                                     OBSTAT0_NWDG_HW(0)                                  /*!< hardware free watchdog */
#define OB_FWDGT_SW                                     OBSTAT0_NWDG_HW(1)                                  /*!< software free watchdog */

/* option byte Firmware image (image must contain a certificate) verification */
#define OBSTAT0_VFALL(regval)                           (BIT(5) & ((uint32_t)(regval) << 5U))
#define OB_FW_IMAGE_VERIFICATION_DISABLE                OBSTAT0_VFALL(0)                                    /*!< Disable firmware image verification */
#define OB_FW_IMAGE_VERIFICATION_ENABLE                 OBSTAT0_VFALL(1)                                    /*!< Enable firmware image verification */

/* option byte reset or not entering deep sleep mode */
#define OBSTAT0_NRST_DPSLP(regval)                      (BIT(6) & ((uint32_t)(regval) << 6U))
#define OB_DEEPSLEEP_RST                                OBSTAT0_NRST_DPSLP(0)                               /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST                               OBSTAT0_NRST_DPSLP(1)                               /*!< no reset when entering deepsleep mode */

/* option byte reset or not entering standby mode */
#define OBSTAT0_NRST_STDBY(regval)                      (BIT(7) & ((uint32_t)(regval) << 7U))
#define OB_STDBY_RST                                    OBSTAT0_NRST_STDBY(0)                               /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                                   OBSTAT0_NRST_STDBY(1)                               /*!< no reset when entering deepsleep mode */

/* option byte security protection configuration */
#define OBSTAT0_SPC(regval)                             (BITS(8,15) & ((uint32_t)(regval) << 8U))
#define OB_NSPC                                         OBSTAT0_SPC(0xAAU)                                  /*!< no protection */
#define OB_LSPC                                         OBSTAT0_SPC(0xBBU)                                  /*!< protection level low */
#define OB_HSPC                                         OBSTAT0_SPC(0xCCU)                                  /*!< protection level high */

/* option byte OTA check */
#define OBSTAT0_OTA_CHECK(regval)                       (BIT(16) & ((uint32_t)(regval) << 16U))
#define OB_OTA_CHECK_DISABLE                            OBSTAT0_OTA_CHECK(0)                                /*!< disable firmware check */
#define OB_OTA_CHECK_ENABLE                             OBSTAT0_OTA_CHECK(1)                                /*!< enable firmware check */

/* option byte FWDG status in deep-sleep mode */
#define OBSTAT0_FWDGSPD_DPSLP(regval)                   (BIT(17) & ((uint32_t)(regval)<< 17U))
#define OB_DPSLP_FWDGT_SUSPEND                          OBSTAT0_FWDGSPD_DPSLP(0)                            /*!< free watchdog is suspended in deep-sleep mode */
#define OB_DPSLP_FWDGT_RUN                              OBSTAT0_FWDGSPD_DPSLP(1)                            /*!< free watchdog is running in deep-sleep mode */

/* option byte FWDG status in standby mode */
#define OBSTAT0_FWDGSPD_STDBY(regval)                   (BIT(18) & ((uint32_t)(regval) << 18U))
#define OB_STDBY_FWDGT_SUSPEND                          OBSTAT0_FWDGSPD_STDBY(0)                            /*!< free watchdog is suspended in standby mode */
#define OB_STDBY_FWDGT_RUN                              OBSTAT0_FWDGSPD_STDBY(1)                            /*!< free watchdog is running in standby mode */

/* option byte firmware update */
#define OBSTAT0_FW_UPDATE(regval)                       (BIT(19) & ((uint32_t)(regval) << 19U))
#define OB_FW_UPDATE_DISABLE                            OBSTAT0_FW_UPDATE(0)                                /*!< disable hardware copies flash backup data to ENVM */
#define OB_FW_UPDATE_ENABLE                             OBSTAT0_FW_UPDATE(1)                                /*!< enable hardware copies flash backup data to ENVM */

/* option byte swap status */
#define OBSTAT0_SWAP(regval)                            (BIT(20) & ((uint32_t)(regval) << 20U))
#define OB_ENVM_BANK0_BACKUP                            OBSTAT0_SWAP(0)                                     /*!< ENVM content is consistent with flash bank0 backup */
#define OB_ENVM_BANK1_BACKUP                            OBSTAT0_SWAP(1)                                     /*!< ENVM content is consistent with flash bank1 backup */

