wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* option byte security access mode configuration */
#define OBSTAT0_SCR(regval)                             (BIT(21) & ((uint32_t)(regval) << 21U))
#define OB_SECURE_MODE_DISABLE                          OBSTAT0_SCR(0)                                      /*!< secure mode disable */
#define OB_SECURE_MODE_ENABLE                           OBSTAT0_SCR(1)                                      /*!< secure mode enable */

#define OBSTAT0_ITCMECCEN(regval)                       (BIT(22) & ((uint32_t)(regval) << 22U))
#define OB_ITCM_ECC_DISABLE                             OBSTAT0_ITCMECCEN(0)                                /*!< disable CPU ITCM ECC function */
#define OB_ITCM_ECC_ENABLE                              OBSTAT0_ITCMECCEN(1)                                /*!< enable CPU ITCM ECC function */

#define OBSTAT0_DTCM0ECCEN(regval)                      (BIT(23) & ((uint32_t)(regval) << 23U))
#define OB_DTCM0_ECC_DISABLE                            OBSTAT0_DTCM0ECCEN(0)                               /*!< disable CPU DTCM0 ECC function */
#define OB_DTCM0_ECC_ENABLE                             OBSTAT0_DTCM0ECCEN(1)                               /*!< enable CPU DTCM0 ECC function */

#define OBSTAT0_DTCM1ECCEN(regval)                      (BIT(24) & ((uint32_t)(regval) << 24U))
#define OB_DTCM1_ECC_DISABLE                            OBSTAT0_DTCM1ECCEN(0)                               /*!< disable CPU DTCM1 ECC function */
#define OB_DTCM1_ECC_ENABLE                             OBSTAT0_DTCM1ECCEN(1)                               /*!< enable CPU DTCM0 ECC function */

#define OBSTAT0_R2_SRAM_ECCEN(regval)                   (BIT(25) & ((uint32_t)(regval) << 25U))
#define OB_R2_SRAM_ECC_DISABLE                          OBSTAT0_R2_SRAM_ECCEN(0)                            /*!< disable Region 2 SRAM ECC function */
#define OB_R2_SRAM_ECC_ENABLE                           OBSTAT0_R2_SRAM_ECCEN(1)                            /*!< enable Region 2 SRAM ECC function */

#define OBSTAT0_R1_SRAM_ECCEN(regval)                   (BIT(26) & ((uint32_t)(regval) << 26U))
#define OB_R1_SRAM_ECC_DISABLE                          OBSTAT0_R1_SRAM_ECCEN(0)                            /*!< disable Region 1 SRAM ECC function */
#define OB_R1_SRAM_ECC_ENABLE                           OBSTAT0_R1_SRAM_ECCEN(1)                            /*!< enable Region 1 SRAM ECC function */

#define OBSTAT0_R0_SRAM_ECCEN(regval)                   (BIT(27) & ((uint32_t)(regval) << 27U))
#define OB_R0_SRAM_ECC_DISABLE                          OBSTAT0_R0_SRAM_ECCEN(0)                            /*!< disable Region 0 SRAM ECC function */
#define OB_R0_SRAM_ECC_ENABLE                           OBSTAT0_R0_SRAM_ECCEN(1)                            /*!< enable Region 0 SRAM ECC function */

#define OBSTAT0_ENVM_ECC_OVRD(regval)                   (BIT(28) & ((uint32_t)(regval) << 28U))
#define OB_ENVM_ECC_CONTROL_BY_ENVM_ECC_MODE            OBSTAT0_ENVM_ECC_OVRD(0)                            /*!< disable ENVM ECC function */
#define OB_ENVM_ECC_ENABLE                              OBSTAT0_ENVM_ECC_OVRD(1)                            /*!< enable ENVM ECC function */

/* option byte I/O speed optimization configuration */
#define OBSTAT0_IOSPDOPEN(regval)                       (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_IOSPDOPEN_DISABLE                            OBSTAT0_IOSPDOPEN(0)                                /*!< high-speed at low-voltage diable */
#define OB_IOSPDOPEN_ENABLE                             OBSTAT0_IOSPDOPEN(1)                                /*!< high-speed at low-voltage enable */

/* option byte pipe mode configuration */
#define OBSTAT0_NOPIPE_MODE(regval)                     (BIT(30) & ((uint32_t)(regval) << 30U))
#define OB_TIMING_FRIENDLY_MODE                         OBSTAT0_NOPIPE_MODE(0)                              /*!< Timing friendly mode */
#define OB_PERFORMANCE_FRIENDLY_MODE                    OBSTAT0_NOPIPE_MODE(1)                              /*!< Performance-first mode */

/* option byte I/O speed optimization configuration */
#define OBSTAT0_VFIMG(regval)                           (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_FIRMWARE_IMG_VERIFY_DISABLE                  OBSTAT0_VFIMG(0)                                    /*!< Disable firmware image verification */
#define OB_FIRMWARE_IMG_VERIFY_ENABLE                   OBSTAT0_VFIMG(1)                                    /*!< Enable firmware image verification */

/* option byte flash bank1 DCRP function enable configuration */
#define OB_DCRPADDR_FLB1_DCRP_EN(regval)                (BIT(13) & ((uint32_t)(regval) << 13U))
#define OB_FL_BANK1_DCRP_AREA_DISABLE                   OB_DCRPADDR_FLB1_DCRP_EN(0)                         /*!< flash bank1 DCRP function disable */
#define OB_FL_BANK1_DCRP_AREA_ENABLE                    OB_DCRPADDR_FLB1_DCRP_EN(1)                         /*!< flash bank1 DCRP function enable */

/* option byte flash bank0 DCRP function enable configuration */
#define OB_DCRPADDR_FLB0_DCRP_EN(regval)                (BIT(14) & ((uint32_t)(regval) << 14U))
#define OB_FL_BANK0_DCRP_AREA_DISABLE                   OB_DCRPADDR_FLB0_DCRP_EN(0)                         /*!< flash bank0 DCRP function disable */
#define OB_FL_BANK0_DCRP_AREA_ENABLE                    OB_DCRPADDR_FLB0_DCRP_EN(1)                         /*!< flash bank0 DCRP function enable */

/* option byte ENVM DCRP function enable configuration */
#define OB_DCRPADDR_ENVM_DCRP_EN(regval)                (BIT(15) & ((uint32_t)(regval) << 15U))
#define OB_ENVM_DCRP_AREA_DISABLE                       OB_DCRPADDR_ENVM_DCRP_EN(0)                         /*!< ENVM region DCRP function disable */
#define OB_ENVM_DCRP_AREA_ENABLE                        OB_DCRPADDR_ENVM_DCRP_EN(1)                         /*!< ENVM region DCRP function enable */

/* option byte flash bank1 DCRP erase enable configuration */
#define OB_DCRPADDR_FLB1_DCRP_EREN(regval)              (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_FL_BANK1_DCRP_AREA_ERASE_DISABLE             OB_DCRPADDR_FLB1_DCRP_EREN(0)                       /*!< flash bank1 region DCRP area erase disable */
#define OB_FL_BANK1_DCRP_AREA_ERASE_ENABLE              OB_DCRPADDR_FLB1_DCRP_EREN(1)                       /*!< flash bank1 region DCRP area erase enable */

/* option byte flash bank0 DCRP erase enable configuration */
#define OB_DCRPADDR_FLB0_DCRP_EREN(regval)              (BIT(30) & ((uint32_t)(regval) << 30U))
#define OB_FL_BANK0_DCRP_AREA_ERASE_DISABLE             OB_DCRPADDR_FLB0_DCRP_EREN(0)                       /*!< flash bank0 region DCRP area erase disable */
#define OB_FL_BANK0_DCRP_AREA_ERASE_ENABLE              OB_DCRPADDR_FLB0_DCRP_EREN(1)                       /*!< flash bank0 region DCRP area erase enable */

