wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* option byte ENVM DCRP erase enable configuration */
#define OB_DCRPADDR_ENVM_DCRP_EREN(regval)              (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_ENVM_DCRP_AREA_ERASE_DISABLE                 OB_DCRPADDR_ENVM_DCRP_EREN(0)                       /*!< ENVM region DCRP area erase disable */
#define OB_ENVM_DCRP_AREA_ERASE_ENABLE                  OB_DCRPADDR_ENVM_DCRP_EREN(1)                       /*!< ENVM region DCRP area erase enable */

/* option byte flash bank1 secure function enable configuration */
#define OB_SCRADDR_FLB1_SECURE_EN(regval)               (BIT(13) & ((uint32_t)(regval) << 13U))
#define OB_FL_BANK1_SECURE_AREA_DISABLE                 OB_SCRADDR_FLB1_SECURE_EN(0)                        /*!< flash bank1 region secure function disable */
#define OB_FL_BANK1_SECURE_AREA_ENABLE                  OB_SCRADDR_FLB1_SECURE_EN(1)                        /*!< flash bank1 region secure function enable */

/* option byte flash bank0 secure function enable configuration */
#define OB_SCRADDR_FLB0_SECURE_EN(regval)               (BIT(14) & ((uint32_t)(regval) << 14U))
#define OB_FL_BANK0_SECURE_AREA_DISABLE                 OB_SCRADDR_FLB0_SECURE_EN(0)                        /*!< flash bank0 region secure function disable */
#define OB_FL_BANK0_SECURE_AREA_ENABLE                  OB_SCRADDR_FLB0_SECURE_EN(1)                        /*!< flash bank0 region secure function enable */

/* option byte ENVM secure function enable configuration */
#define OB_SCRADDR_ENVM_SECURE_EN(regval)               (BIT(15) & ((uint32_t)(regval) << 15U))
#define OB_ENVM_SECURE_AREA_DISABLE                     OB_SCRADDR_ENVM_SECURE_EN(0)                        /*!< ENVM region SCR function disable */
#define OB_ENVM_SECURE_AREA_ENABLE                      OB_SCRADDR_ENVM_SECURE_EN(1)                        /*!< ENVM region SCR function enable */

/* option byte flash bank1 secure erase enable configuration */
#define OB_SCRADDR_FLB1_SECURE_EREN(regval)             (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_FL_BANK1_SECURE_AREA_ERASE_DISABLE           OB_SCRADDR_FLB1_SECURE_EREN(0)                      /*!< flash bank1 region secure area erase disable */
#define OB_FL_BANK1_SECURE_AREA_ERASE_ENABLE            OB_SCRADDR_FLB1_SECURE_EREN(1)                      /*!< flash bank1 region secure area erase enable */

/* option byte flash bank0 secure erase enable configuration */
#define OB_SCRADDR_FLB0_SECURE_EREN(regval)             (BIT(30) & ((uint32_t)(regval) << 30U))
#define OB_FL_BANK0_SECURE_AREA_ERASE_DISABLE           OB_SCRADDR_FLB0_SECURE_EREN(0)                      /*!< flash bank0 region secure area erase disable */
#define OB_FL_BANK0_SECURE_AREA_ERASE_ENABLE            OB_SCRADDR_FLB0_SECURE_EREN(1)                      /*!< flash bank0 region secure area erase enable */

/* option byte flash bank0 secure erase enable configuration */
#define OB_SCRADDR_ENVM_SECURE_EREN(regval)             (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_ENVM_SECURE_AREA_ERASE_DISABLE               OB_SCRADDR_ENVM_SECURE_EREN(0)                      /*!< ENVM region secure area erase disable */
#define OB_ENVM_SECURE_AREA_ERASE_ENABLE                OB_SCRADDR_ENVM_SECURE_EREN(1)                      /*!< ENVM region secure area erase enable */

/* option byte ENVM write protection */
#define OB_ENVM_WP_0                                    ((uint32_t)0x00000001U)                             /*!< ENVM erase/program protection of write protection sector 0~1 */
#define OB_ENVM_WP_1                                    ((uint32_t)0x00000002U)                             /*!< ENVM erase/program protection of write protection sector 2~3 */
#define OB_ENVM_WP_2                                    ((uint32_t)0x00000004U)                             /*!< ENVM erase/program protection of write protection sector 4~5 */
#define OB_ENVM_WP_3                                    ((uint32_t)0x00000008U)                             /*!< ENVM erase/program protection of write protection sector 6~7 */
#define OB_ENVM_WP_4                                    ((uint32_t)0x00000010U)                             /*!< ENVM erase/program protection of write protection sector 8~9 */
#define OB_ENVM_WP_5                                    ((uint32_t)0x00000020U)                             /*!< ENVM erase/program protection of write protection sector 10~11 */
#define OB_ENVM_WP_6                                    ((uint32_t)0x00000040U)                             /*!< ENVM erase/program protection of write protection sector 12~13 */
#define OB_ENVM_WP_7                                    ((uint32_t)0x00000080U)                             /*!< ENVM erase/program protection of write protection sector 14~15 */
#define OB_ENVM_WP_8                                    ((uint32_t)0x00000100U)                             /*!< ENVM erase/program protection of write protection sector 16~17 */
#define OB_ENVM_WP_9                                    ((uint32_t)0x00000200U)                             /*!< ENVM erase/program protection of write protection sector 18~19 */
#define OB_ENVM_WP_10                                   ((uint32_t)0x00000400U)                             /*!< ENVM erase/program protection of write protection sector 20~21 */
#define OB_ENVM_WP_11                                   ((uint32_t)0x00000800U)                             /*!< ENVM erase/program protection of write protection sector 22~23 */
#define OB_ENVM_WP_12                                   ((uint32_t)0x00001000U)                             /*!< ENVM erase/program protection of write protection sector 24~25 */
#define OB_ENVM_WP_13                                   ((uint32_t)0x00002000U)                             /*!< ENVM erase/program protection of write protection sector 26~27 */
#define OB_ENVM_WP_14                                   ((uint32_t)0x00004000U)                             /*!< ENVM erase/program protection of write protection sector 28~29 */
#define OB_ENVM_WP_15                                   ((uint32_t)0x00008000U)                             /*!< ENVM erase/program protection of write protection sector 30~31 */
#if defined(NVM_VER_CASE2)
#define OB_ENVM_WP_ALL                                  ((uint32_t)0x0000FFFFU)                             /*!< ENVM erase/program protection of all sectors */
#elif defined(NVM_VER_CASE3)
#define OB_ENVM_WP_ALL                                  ((uint32_t)0x000000FFU)                             /*!< ENVM erase/program protection of all sectors */
#elif defined(NVM_VER_CASE4)
#define OB_ENVM_WP_ALL                                  ((uint32_t)0x00001FFFU)                             /*!< ENVM erase/program protection of all sectors */
#else
#define OB_ENVM_WP_ALL                                  ((uint32_t)0x0000FFFFU)                             /*!< ENVM erase/program protection of all sectors */
#endif /* NVM_VER_CASEx */

/* option byte flash write protection */
#define OB_FL_WP_0                                      ((uint64_t)0x0000000000000001U)                     /*!< flash erase/program protection of write protection sector 32~33 */
#define OB_FL_WP_1                                      ((uint64_t)0x0000000000000002U)                     /*!< flash erase/program protection of write protection sector 34~35 */
#define OB_FL_WP_2                                      ((uint64_t)0x0000000000000004U)                     /*!< flash erase/program protection of write protection sector 36~37 */
#define OB_FL_WP_3                                      ((uint64_t)0x0000000000000008U)                     /*!< flash erase/program protection of write protection sector 38~39 */
#define OB_FL_WP_4                                      ((uint64_t)0x0000000000000010U)                     /*!< flash erase/program protection of write protection sector 40~41 */
#define OB_FL_WP_5                                      ((uint64_t)0x0000000000000020U)                     /*!< flash erase/program protection of write protection sector 42~43 */
#define OB_FL_WP_6                                      ((uint64_t)0x0000000000000040U)                     /*!< flash erase/program protection of write protection sector 44~45 */
#define OB_FL_WP_7                                      ((uint64_t)0x0000000000000080U)                     /*!< flash erase/program protection of write protection sector 46~47 */
#define OB_FL_WP_8                                      ((uint64_t)0x0000000000000100U)                     /*!< flash erase/program protection of write protection sector 48~49 */
#define OB_FL_WP_9                                      ((uint64_t)0x0000000000000200U)                     /*!< flash erase/program protection of write protection sector 50~51 */
#define OB_FL_WP_10                                     ((uint64_t)0x0000000000000400U)                     /*!< flash erase/program protection of write protection sector 52~53 */
#define OB_FL_WP_11                                     ((uint64_t)0x0000000000000800U)                     /*!< flash erase/program protection of write protection sector 54~55 */
#define OB_FL_WP_12                                     ((uint64_t)0x0000000000001000U)                     /*!< flash erase/program protection of write protection sector 56~57 */
#define OB_FL_WP_13                                     ((uint64_t)0x0000000000002000U)                     /*!< flash erase/program protection of write protection sector 58~59 */
#define OB_FL_WP_14                                     ((uint64_t)0x0000000000004000U)                     /*!< flash erase/program protection of write protection sector 60~61 */
#define OB_FL_WP_15                                     ((uint64_t)0x0000000000008000U)                     /*!< flash erase/program protection of write protection sector 62~63 */
#define OB_FL_WP_16                                     ((uint64_t)0x0000000000010000U)                     /*!< flash erase/program protection of write protection sector 64~65 */
#define OB_FL_WP_17                                     ((uint64_t)0x0000000000020000U)                     /*!< flash erase/program protection of write protection sector 66~67 */
#define OB_FL_WP_18                                     ((uint64_t)0x0000000000040000U)                     /*!< flash erase/program protection of write protection sector 68~69 */
#define OB_FL_WP_19                                     ((uint64_t)0x0000000000080000U)                     /*!< flash erase/program protection of write protection sector 70~71 */
#define OB_FL_WP_20                                     ((uint64_t)0x0000000000100000U)                     /*!< flash erase/program protection of write protection sector 72~73 */
#define OB_FL_WP_21                                     ((uint64_t)0x0000000000200000U)                     /*!< flash erase/program protection of write protection sector 74~75 */
#define OB_FL_WP_22                                     ((uint64_t)0x0000000000400000U)                     /*!< flash erase/program protection of write protection sector 76~77 */
#define OB_FL_WP_23                                     ((uint64_t)0x0000000000800000U)                     /*!< flash erase/program protection of write protection sector 78~79 */
#define OB_FL_WP_24                                     ((uint64_t)0x0000000001000000U)                     /*!< flash erase/program protection of write protection sector 80~81 */
#define OB_FL_WP_25                                     ((uint64_t)0x0000000002000000U)                     /*!< flash erase/program protection of write protection sector 82~83 */
#define OB_FL_WP_26                                     ((uint64_t)0x0000000004000000U)                     /*!< flash erase/program protection of write protection sector 84~85 */
#define OB_FL_WP_27                                     ((uint64_t)0x0000000008000000U)                     /*!< flash erase/program protection of write protection sector 86~87 */
#define OB_FL_WP_28                                     ((uint64_t)0x0000000010000000U)                     /*!< flash erase/program protection of write protection sector 88~89 */
#define OB_FL_WP_29                                     ((uint64_t)0x0000000020000000U)                     /*!< flash erase/program protection of write protection sector 90~91 */
#define OB_FL_WP_30                                     ((uint64_t)0x0000000040000000U)                     /*!< flash erase/program protection of write protection sector 92~93 */
#define OB_FL_WP_31                                     ((uint64_t)0x0000000080000000U)                     /*!< flash erase/program protection of write protection sector 94~95 */
#define OB_FL_WP_32                                     ((uint64_t)0x0000000100000000U)                     /*!< flash erase/program protection of write protection sector 96~97 */
#define OB_FL_WP_33                                     ((uint64_t)0x0000000200000000U)                     /*!< flash erase/program protection of write protection sector 98~99 */
#define OB_FL_WP_34                                     ((uint64_t)0x0000000400000000U)                     /*!< flash erase/program protection of write protection sector 100~101 */
#define OB_FL_WP_35                                     ((uint64_t)0x0000000800000000U)                     /*!< flash erase/program protection of write protection sector 102~103 */
#define OB_FL_WP_36                                     ((uint64_t)0x0000001000000000U)                     /*!< flash erase/program protection of write protection sector 104~105 */
#define OB_FL_WP_37                                     ((uint64_t)0x0000002000000000U)                     /*!< flash erase/program protection of write protection sector 106~107 */
#define OB_FL_WP_38                                     ((uint64_t)0x0000004000000000U)                     /*!< flash erase/program protection of write protection sector 108~109 */
#define OB_FL_WP_39                                     ((uint64_t)0x0000008000000000U)                     /*!< flash erase/program protection of write protection sector 110~111 */
#define OB_FL_WP_40                                     ((uint64_t)0x0000010000000000U)                     /*!< flash erase/program protection of write protection sector 112~113 */
#define OB_FL_WP_41                                     ((uint64_t)0x0000020000000000U)                     /*!< flash erase/program protection of write protection sector 114~115 */
#define OB_FL_WP_42                                     ((uint64_t)0x0000040000000000U)                     /*!< flash erase/program protection of write protection sector 116~117 */
#define OB_FL_WP_43                                     ((uint64_t)0x0000080000000000U)                     /*!< flash erase/program protection of write protection sector 118~119 */
#define OB_FL_WP_44                                     ((uint64_t)0x0000100000000000U)                     /*!< flash erase/program protection of write protection sector 120~121 */
#define OB_FL_WP_45                                     ((uint64_t)0x0000200000000000U)                     /*!< flash erase/program protection of write protection sector 122~123 */
#define OB_FL_WP_46                                     ((uint64_t)0x0000400000000000U)                     /*!< flash erase/program protection of write protection sector 124~125 */
#define OB_FL_WP_47                                     ((uint64_t)0x0000800000000000U)                     /*!< flash erase/program protection of write protection sector 126~127 */
#define OB_FL_WP_48                                     ((uint64_t)0x0001000000000000U)                     /*!< flash erase/program protection of write protection sector 128~129 */
#define OB_FL_WP_49                                     ((uint64_t)0x0002000000000000U)                     /*!< flash erase/program protection of write protection sector 130~131 */
#define OB_FL_WP_50                                     ((uint64_t)0x0004000000000000U)                     /*!< flash erase/program protection of write protection sector 132~133 */
#define OB_FL_WP_51                                     ((uint64_t)0x0008000000000000U)                     /*!< flash erase/program protection of write protection sector 134~135 */
#define OB_FL_WP_52                                     ((uint64_t)0x0010000000000000U)                     /*!< flash erase/program protection of write protection sector 136~137 */
#define OB_FL_WP_53                                     ((uint64_t)0x0020000000000000U)                     /*!< flash erase/program protection of write protection sector 138~139 */
#define OB_FL_WP_54                                     ((uint64_t)0x0040000000000000U)                     /*!< flash erase/program protection of write protection sector 140~141 */
#define OB_FL_WP_55                                     ((uint64_t)0x0080000000000000U)                     /*!< flash erase/program protection of write protection sector 142~143 */
#define OB_FL_WP_56                                     ((uint64_t)0x0100000000000000U)                     /*!< flash erase/program protection of write protection sector 144~145 */
#define OB_FL_WP_57                                     ((uint64_t)0x0200000000000000U)                     /*!< flash erase/program protection of write protection sector 146~147 */
#define OB_FL_WP_58                                     ((uint64_t)0x0400000000000000U)                     /*!< flash erase/program protection of write protection sector 148~149 */
#define OB_FL_WP_59                                     ((uint64_t)0x0800000000000000U)                     /*!< flash erase/program protection of write protection sector 150~151 */
#ifndef NVM_VER_CASE4
#if defined(NVM_VER_CASE2)
#define OB_FL_WP_ALL                                    ((uint64_t)0x000000000FFFFFFFU)                     /*!< flash erase/program protection of all sectors */
#elif defined(NVM_VER_CASE3)
#define OB_FL_WP_ALL                                    ((uint64_t)0x000000000FFFFFFFU)                     /*!< flash erase/program protection of all sectors */
#else
#define OB_FL_WP_ALL                                    ((uint64_t)0x0FFFFFFFFFFFFFFFU)                     /*!< flash erase/program protection of all sectors */
#endif /* NVM_VER_CASEx */
#endif /* NVM_VER_CASE4 */

/* option byte The power-on reset self-check repair function enable status bit */
#define OBREPCTL_PORRSTREPDIS(regval)                   (BIT(15) & ((uint32_t)(regval) << 15U))
#define POR_RESET_REPAIR_DISABLE                        OBREPCTL_PORRSTREPDIS(1)                            /*!< disable power-on reset self-check repair function */
#define POR_RESET_REPAIR_ENABLE                         OBREPCTL_PORRSTREPDIS(0)                            /*!< enable power-on reset self-check repair function */

