wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* option byte The system reset self-check repair function enable status bit */
#define OBREPCTL_SYSRSTREPDIS(regval)                   (BIT(14) & ((uint32_t)(regval) << 14U))
#define SYS_RESET_REPAIR_DISABLE                        OBREPCTL_SYSRSTREPDIS(1)                            /*!< disable system reset self-check repair function */
#define SYS_RESET_REPAIR_ENABLE                         OBREPCTL_SYSRSTREPDIS(0)                            /*!< enable system reset self-check repair function */

/* option byte Mode of determining whether the repair is successful after the repair */
#define OBREPCTL_BBMODE(regval)                         (BIT(13) & ((uint32_t)(regval) << 13U))
#define REPAIR_FAIL_FOR_ANY_ERROR                       OBREPCTL_BBMODE(0)                                  /*!< After repair, any error occurs as repair failure */
#define REPAIR_FAIL_FOR_MORE_THAN_ERR1                  OBREPCTL_BBMODE(1)                                  /*!< After repair, errors greater than 1 bit as repair failure */

/* option byte 2 bits error automatic repair enable status bit  */
#define OBREPCTL_ERR2AUTOREPEN(regval)                  (BIT(7) & ((uint32_t)(regval) << 7U))
#define ECC2_AUTO_REPAIR_DISABLE                        OBREPCTL_ERR2AUTOREPEN(0)                           /*!< disable 2 bits error automatic repair */
#define ECC2_AUTO_REPAIR_ENABLE                         OBREPCTL_ERR2AUTOREPEN(1)                           /*!< enable 2 bits error automatic repair */

/* option byte 1 bit error automatic repair enable status bit */
#define OBREPCTL_ERR1AUTOREPEN(regval)                  (BIT(6) & ((uint32_t)(regval) << 6U))
#define ECC1_AUTO_REPAIR_DISABLE                        OBREPCTL_ERR1AUTOREPEN(0)                           /*!< disable 1 bit error automatic repair */
#define ECC1_AUTO_REPAIR_ENABLE                         OBREPCTL_ERR1AUTOREPEN(1)                           /*!< enable 1 bit error automatic repair */

/* option byte Bad block address replace status bit */
#define OBREPCTL_BBREPLEN(regval)                       (BIT(5) & ((uint32_t)(regval) << 5U))
#define BAD_ENVM_ADDR_REPLACE_DISABLE                   OBREPCTL_BBREPLEN(0)                                /*!< the data in ENVM is not replaced with flash content when ENVM reads the bad block address */
#define BAD_ENVM_ADDR_REPLACE_ENABLE                    OBREPCTL_BBREPLEN(1)                                /*!< the data in ENVM is automatically replaced with flash content when ENVM reads the bad block address */

/* option byte Two bit error repair enable status bit */
#define OBREPCTL_ERR2REPEN(regval)                      (BIT(4) & ((uint32_t)(regval) << 4U))
#define TWO_BIT_ERR_REPAIR_DISABLE                      OBREPCTL_ERR2REPEN(0)                               /*!< disable repair address with two bit error */
#define TWO_BIT_ERR_REPAIR_ENABLE                       OBREPCTL_ERR2REPEN(1)                               /*!< enable repair address with two bit error */

/* option byte One bit error repair enable status bit */
#define OBREPCTL_ERR1REPEN(regval)                      (BIT(3) & ((uint32_t)(regval) << 3U))
#define ONE_BIT_ERR_REPAIR_DISABLE                      OBREPCTL_ERR1REPEN(0)                               /*!< disable repair address with one bit error */
#define ONE_BIT_ERR_REPAIR_ENABLE                       OBREPCTL_ERR1REPEN(1)                               /*!< enable repair address with one bit error */

/* option byte Bootloader self-check mode status bit */
#define OBREPCTL_BLREPMOD(regval)                       (BIT(2) & ((uint32_t)(regval) << 2U))
#define BOOTLOADER_CHECK_DISABLE                        OBREPCTL_BLREPMOD(0)                                /*!< boot without self-check */
#define BOOTLOADER_CHECK_ENABLE                         OBREPCTL_BLREPMOD(1)                                /*!< bootloader to do a self-check */

/* option byte Hardware self-check mode configuration */
#define OBREPCTL_HWREPMOD(regval)                       (BIT(1) & ((uint32_t)(regval) << 1U))
#define OB_HW_SELF_CHECK_DISABLE                        OBREPCTL_HWREPMOD(0)                                /*!< hardware not do self-check mode (no self-check or self-check by bootloader) */
#define OB_HW_SELF_CHECK_ENABLE                         OBREPCTL_HWREPMOD(1)                                /*!< hardware self-check mode */

/* option byte ENVM synchronization mode configuration */
#define OBREPCTL_SYNEN(regval)                          (BIT(0) & ((uint32_t)(regval) << 0U))
#define OB_SYNC_MODE_DISABLE                            OBREPCTL_SYNEN(0)                                   /*!< disable synchronization mode  */
#define OB_SYNC_MODE_ENABLE                             OBREPCTL_SYNEN(1)                                   /*!< enable synchronization mode */

/* OBSTAT1 */
/* option byte ITCM and DTCM RAM sharing status bit */
#define OBSTAT1_ITCM_DTCM_SHARED(regval)                (BITS(4,6) & ((uint32_t)(regval) << 4U))
#define OB_ITCM_DTCM_SHARED_ITCM_0KB                    OBSTAT1_ITCM_DTCM_SHARED(0)                         /*!< ITCM DTCM shared RAM ITCM size is 0Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_64KB                   OBSTAT1_ITCM_DTCM_SHARED(1)                         /*!< ITCM DTCM shared RAM ITCM size is 64-Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_128KB                  OBSTAT1_ITCM_DTCM_SHARED(2)                         /*!< ITCM DTCM shared RAM ITCM size is 128-Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_192KB                  OBSTAT1_ITCM_DTCM_SHARED(3)                         /*!< ITCM DTCM shared RAM ITCM size is 192-Kbyte */
#define OB_ITCM_DTCM_SHARED_ITCM_256KB                  OBSTAT1_ITCM_DTCM_SHARED(4)                         /*!< ITCM DTCM shared RAM ITCM size is 256-Kbyte */

/* option byte ITCM and AXI RAM sharing status bit */
#define OBSTAT1_ITCM_AXI_SHARED(regval)                 (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define OB_ITCM_AXI_SHARED_ITCM_0KB                     OBSTAT1_ITCM_AXI_SHARED(0)                          /*!< ITCM AXI shared RAM ITCM size is 0-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_64KB                    OBSTAT1_ITCM_AXI_SHARED(1)                          /*!< ITCM AXI shared RAM ITCM size is 64-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_128KB                   OBSTAT1_ITCM_AXI_SHARED(2)                          /*!< ITCM AXI shared RAM ITCM size is 128-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_192KB                   OBSTAT1_ITCM_AXI_SHARED(3)                          /*!< ITCM AXI shared RAM ITCM size is 192-Kbyte */
#define OB_ITCM_AXI_SHARED_ITCM_256KB                   OBSTAT1_ITCM_AXI_SHARED(4)                          /*!< ITCM AXI shared RAM ITCM size is 256-Kbyte */

