wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* boot pin value definitions */
#define BOOT_PIN_0                                      ((uint32_t)0x00000000U)                             /*!< boot pin value is '0' */
#define BOOT_PIN_1                                      ((uint32_t)0x00000001U)                             /*!< boot pin value is '1' */

/* option byte CPU bus timeout status bit */
#define OBSTAT1_CPUBUSTO(regval)                        (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_DISABLE         OBSTAT1_CPUBUSTO(0)                                 /*!<  CPU bus timeout reset value in SYSCFG_BUSTO is disable*/
#define OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_ENABLE          OBSTAT1_CPUBUSTO(1)                                 /*!<  CPU bus timeout reset value in SYSCFG_BUSTO is enable*/

/* ENVM interrupt enable */
#define ENVM_INT_ENDIE                                  NVMC_ENVM_CTL_ENDIE                                 /*!< ENVM end of operation interrupt enable bit */
#define ENVM_INT_WPERRIE                                NVMC_ENVM_CTL_WPERRIE                               /*!< ENVM write protection error interrupt enable bit */
#define ENVM_INT_PGSERRIE                               NVMC_ENVM_CTL_PGSERRIE                              /*!< ENVM program sequence error interrupt enable bit */
#define ENVM_INT_RPERRIE                                NVMC_ENVM_CTL_RPERRIE                               /*!< ENVM read protection error interrupt enable bit */
#define ENVM_INT_RSERRIE                                NVMC_ENVM_CTL_RSERRIE                               /*!< ENVM read secure error interrupt enable bit */
#define ENVM_INT_AUTOECCSERRDETIE                       NVMC_ENVM_CTL_AUTOECCSERRDETIE                      /*!< ENVM one bit detect error interrupt enable bit */
#define ENVM_INT_AUTOECCDERRDETIE                       NVMC_ENVM_CTL_AUTOECCDERRDETIE                      /*!< ENVM two bits detect error interrupt enable bit */
#define ENVM_INT_CRCCALENDIE                            NVMC_ENVM_CTL_CRCENDCALIE                           /*!< ENVM CRC end of calculation interrupt enable bit */
#define ENVM_INT_CRCRERRIE                              NVMC_ENVM_CTL_CRCRERRIE                             /*!< ENVM CRC read error interrupt enable bit */
#define ENVM_INT_REPAIR_ECC1CNTIE                       NVMC_ENVM_REPCS_ECC1CNTIE                           /*!< ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt enable bit  */
#define ENVM_INT_REPAIR_ECC2CNTIE                       NVMC_ENVM_REPCS_ECC2CNTIE                           /*!< ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold interrupt enable bit  */
#define ENVM_INT_REPAIR_FLBLANKIE                       NVMC_ENVM_REPCS_FLBLANKIE                           /*!< ENVM Flash backup content is blank interrupt enable bit  */
#define ENVM_INT_REPAIR_DONEIE                          NVMC_ENVM_REPCS_REPDONEIE                           /*!< ENVM self-repair done interrupt enable bit  */

/* ENVM flags */
#define ENVM_FLAG_BUSY                                  NVMC_ENVM_STAT_BUSY                                 /*!< ENVM busy flag */
#define ENVM_FLAG_ENDF                                  NVMC_ENVM_STAT_ENDF                                 /*!< ENVM end of operation flag */
#define ENVM_FLAG_WPERR                                 NVMC_ENVM_STAT_WPERR                                /*!< ENVM write protection error flag */
#define ENVM_FLAG_PGSERR                                NVMC_ENVM_STAT_PGSERR                               /*!< ENVM program sequence error flag */
#define ENVM_FLAG_OTAFAIL                               NVMC_ENVM_STAT_OTAFAIL                              /*!< ENVM OTA update, check_bootloader check failure flag */
#define ENVM_FLAG_OTASUC                                NVMC_ENVM_STAT_OTASUC                               /*!< ENVM OTA update, check_bootloader check success flag */
#define ENVM_FLAG_COPYSTRERR                            NVMC_ENVM_STAT_COPYSTRERR                           /*!< ENVM copy startup failure error flag */
#define ENVM_FLAG_RPERR                                 NVMC_ENVM_STAT_RPERR                                /*!< ENVM read protection error flag */
#define ENVM_FLAG_RSERR                                 NVMC_ENVM_STAT_RSERR                                /*!< ENVM read secure error flag */
#define ENVM_FLAG_AUTOECCSERRDET                        NVMC_ENVM_STAT_AUTOECCSERRDET                       /*!< ENVM one bit detect error flag */
#define ENVM_FLAG_AUTOECCDERRDET                        NVMC_ENVM_STAT_AUTOECCDERRDET                       /*!< ENVM two bits detect error flag */
#define ENVM_FLAG_CRCBUSY                               NVMC_ENVM_STAT_CRCBUSY                              /*!< ENVM crc busy flag */
#define ENVM_FLAG_CRCCALEND                             NVMC_ENVM_STAT_CRCENDCAL                            /*!< ENVM CRC end of calculation flag */
#define ENVM_FLAG_CRCRERR                               NVMC_ENVM_STAT_CRCRERR                              /*!< ENVM CRC read error flag */
#define ENVM_FLAG_NMIERRINT                             NVMC_ENVM_REPCS_NMIERRINT                           /*!< ENVM AXI read, repair failure with 3-bit error flag */
#define ENVM_FLAG_REPAIR_ECC1CNTIF                      NVMC_ENVM_REPCS_ECC1CNTIF                           /*!< ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold flag */
#define ENVM_FLAG_REPAIR_ECC2CNTIF                      NVMC_ENVM_REPCS_ECC2CNTIF                           /*!< ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold flag */
#define ENVM_FLAG_REPAIR_FLBLANK                        NVMC_ENVM_REPCS_FLBLANK                             /*!< ENVM Flash backup content is blank flag */
#define ENVM_FLAG_REPAIR_END                            NVMC_ENVM_REPCS_REPEND                              /*!< ENVM self-repair end flag */
#define ENVM_FLAG_REPAIR_REPSTRERR                      NVMC_ENVM_REPCS_REPSTRERR                           /*!< ENVM self-check repair configuration error flag */

/* ENVM interrupt flags */
#define ENVM_INT_FLAG_ENDF                              ((uint8_t)0x00U)                                    /*!< ENVM end of operation interrupt flag */
#define ENVM_INT_FLAG_WPERR                             ((uint8_t)0x01U)                                    /*!< ENVM write protection error interrupt flag */
#define ENVM_INT_FLAG_PGSERR                            ((uint8_t)0x02U)                                    /*!< ENVM program sequence error interrupt flag */
#define ENVM_INT_FLAG_RPERR                             ((uint8_t)0x03U)                                    /*!< ENVM read protection error interrupt flag */
#define ENVM_INT_FLAG_RSERR                             ((uint8_t)0x04U)                                    /*!< ENVM read secure error interrupt flag */
#define ENVM_INT_FLAG_AUTOECCSERRDET                    ((uint8_t)0x05U)                                    /*!< ENVM one bit detect error interrupt flag */
#define ENVM_INT_FLAG_AUTOECCDERRDET                    ((uint8_t)0x06U)                                    /*!< ENVM two bits detect error interrupt flag */
#define ENVM_INT_FLAG_CRCCALEND                         ((uint8_t)0x07U)                                    /*!< ENVM CRC end of calculation interrupt flag */
#define ENVM_INT_FLAG_CRCRERR                           ((uint8_t)0x08U)                                    /*!< ENVM CRC read error interrupt flag */
#define ENVM_INT_FLAG_REPAIR_ECC1CNTIF                  ((uint8_t)0x09U)                                    /*!< ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt flag */
#define ENVM_INT_FLAG_REPAIR_ECC2CNTIF                  ((uint8_t)0x0AU)                                    /*!< ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold interrupt flag */
#define ENVM_INT_FLAG_REPAIR_FLBLANK                    ((uint8_t)0x0BU)                                    /*!< ENVM Flash backup content is blank interrupt flag */
#define ENVM_INT_FLAG_REPAIR_END                        ((uint8_t)0x0CU)                                    /*!< ENVM self-repair end interrupt flag */
#define ENVM_INT_FLAG_REPAIR_REPSTRERR                  ((uint8_t)0x0DU)                                    /*!< ENVM self-check repair configuration error interrupt flag */

/* flash interrupt enable */
#define FLASH_INT_ENDIE                                 NVMC_FLASH_CTL_ENDIE                                /*!< flash end of operation interrupt enable bit */
#define FLASH_INT_WPERRIE                               NVMC_FLASH_CTL_WPERRIE                              /*!< flash write protection error interrupt enable bit */
#define FLASH_INT_PGSERRIE                              NVMC_FLASH_CTL_PGSERRIE                             /*!< flash program sequence error interrupt enable bit */
#define FLASH_INT_RPERRIE                               NVMC_FLASH_CTL_RPERRIE                              /*!< flash read protection error interrupt enable bit */
#define FLASH_INT_RSERRIE                               NVMC_FLASH_CTL_RSERRIE                              /*!< flash read secure error interrupt enable bit */
#define FLASH_INT_ECCDETIE                              NVMC_FLASH_CTL_ECCDETIE                             /*!< flash two bits detect error interrupt enable bit */

/* flash flags */
#define FLASH_FLAG_BUSY                                 NVMC_FLASH_STAT_BUSY                                /*!< flash busy flag */
#define FLASH_FLAG_ENDF                                 NVMC_FLASH_STAT_ENDF                                /*!< flash end of operation flag */
#define FLASH_FLAG_WPERR                                NVMC_FLASH_STAT_WPERR                               /*!< flash write protection error flag */
#define FLASH_FLAG_PGSERR                               NVMC_FLASH_STAT_PGSERR                              /*!< flash program sequence error flag */
#define FLASH_FLAG_RPERR                                NVMC_FLASH_STAT_RPERR                               /*!< flash read protection error flag */
#define FLASH_FLAG_RSERR                                NVMC_FLASH_STAT_RSERR                               /*!< flash read secure error flag */
#define FLASH_FLAG_ECCDET                               NVMC_FLASH_STAT_ECCDET                              /*!< flash two bits detect error flag */

/* flash interrupt flags */
#define FLASH_INT_FLAG_ENDF                            ((uint8_t)0x00U)                                     /*!< flash end of operation interrupt flag */
#define FLASH_INT_FLAG_WPERR                           ((uint8_t)0x01U)                                     /*!< flash write protection error interrupt flag */
#define FLASH_INT_FLAG_PGSERR                          ((uint8_t)0x02U)                                     /*!< flash program sequence error interrupt flag */
#define FLASH_INT_FLAG_RPERR                           ((uint8_t)0x03U)                                     /*!< flash read protection error interrupt flag */
#define FLASH_INT_FLAG_RSERR                           ((uint8_t)0x04U)                                     /*!< flash read secure error interrupt flag */
#define FLASH_INT_FLAG_ECCDET                          ((uint8_t)0x05U)                                     /*!< flash two bits detect error interrupt flag */

/* option byte interrupt enable */
#define NVMC_INT_OBMERRIE                               NVMC_OBCTL_OBMERRIE                                 /*!< option byte modified error interrupt enable bit */

/* option byte flags */
#define NVMC_FLAG_OBMERR                                NVMC_OBCTL_OBMERR                                   /*!< option byte modified error flag */

/* option byte interrupt flags */
#define NVMC_INT_FLAG_OBMERR                           ((uint8_t)0x00U)                                    /*!< option byte modified error interrupt flag */

/* OTP interrupt enable */
#define OTP_INT_ENDIE                                   NVMC_OTP_CTL_ENDIE                                  /*!< OTP program/repair end interrupt enable bit */
#define OTP_INT_DATAERRIE                               NVMC_OTP_CTL_DATAERRIE                              /*!< OTP data error interrupt enable bit */
#define OTP_INT_PGLKERRIE                               NVMC_OTP_CTL_PGLKERRIE                              /*!< OTP program at lock state error interrupt enable bit */
#define OTP_INT_PGSERRIE                                NVMC_OTP_CTL_PGSERRIE                               /*!< OTP program sequence error enable bit */
#define OTP_INT_MULTI_DATAERRIE                         NVMC_OTP_CTL_MULTI_DATAERRIE                        /*!< OTP multi-redundant data error interrupt enable bit */

/* OTP flags */
#define OTP_FLAG_BUSY                                   NVMC_OTP_STAT_BUSY                                  /*!< OTP busy flag */
#define OTP_FLAG_ENDF                                   NVMC_OTP_STAT_ENDF                                  /*!< OTP end of operation flag */
#define OTP_FLAG_DATAERR                                NVMC_OTP_STAT_DATAERRF                              /*!< OTP data error flag */
#define OTP_FLAG_PGLKERR                                NVMC_OTP_STAT_PGLKERRF                              /*!< OTP program at lock state error flag */
#define OTP_FLAG_PGSERR                                 NVMC_OTP_STAT_PGSERR                                /*!< OTP program sequence error flag */
#define OTP_FLAG_MULTI_DATAERR                          NVMC_OTP_STAT_MULTI_DATAERRF                        /*!< OTP multi-redundant data error flag */

/* OTP interrupt flags */
#define OTP_INT_FLAG_ENDF                               ((uint8_t)0x00U)                                    /*!< OTP end of operation interrupt flag */
#define OTP_INT_FLAG_DATAERR                            ((uint8_t)0x01U)                                    /*!< OTP data error interrupt flag */
#define OTP_INT_FLAG_PGLKERR                            ((uint8_t)0x02U)                                    /*!< OTP program at lock state error interrupt flag */
#define OTP_INT_FLAG_PGSERR                             ((uint8_t)0x03U)                                    /*!< OTP program sequence error interrupt flag */
#define OTP_INT_FLAG_MULTI_DATAERR                      ((uint8_t)0x04U)                                    /*!< OTP multi-redundant data error interrupt flag */

/* address and size of NVM */
#define ENVM_BASE_ADDRESS                               ((uint32_t)0x08000000U)                             /*!< ENVM base address */
#define MAIN_FLASH_BASE_ADDRESS                         ((uint32_t)0x08200000U)                             /*!< main flash base address */
#define OTP_BASE_ADDRESS                                ((uint32_t)0x1FFF0000U)                             /*!< OTP base address */

#if defined(NVM_VER_CASE2)
/* case2: 3.5MB flash memory and 2MB ENVM */
#define MAIN_FLASH_DFLASH0_BASE_ADDRESS                 ((uint32_t)0x08200000U)                             /*!< main flash data flash0 base address */
#define MAIN_FLASH_BANK0_BASE_ADDRESS                   ((uint32_t)0x08300000U)                             /*!< main flash bank0 base address */
#define MAIN_FLASH_DFLASH1_BASE_ADDRESS                 ((uint32_t)0x08500000U)                             /*!< main flash data flash1 base address */

