wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
#define ENVM_SIZE                                       ((uint32_t)0x00200000U)                             /*!< ENVM size */
#define MAIN_FLASH_SIZE                                 ((uint32_t)0x00380000U)                             /*!< main flash size */
#define MAIN_FLASH_DFLASH0_SIZE                         ((uint32_t)0x00100000U)                             /*!< main flash data flash0 size */
#define MAIN_FLASH_BANK0_SIZE                           ((uint32_t)0x00200000U)                             /*!< main flash bank0 size */
#define MAIN_FLASH_DFLASH1_SIZE                         ((uint32_t)0x00080000U)                             /*!< main flash data flash1 size */

#elif defined(NVM_VER_CASE3)
/* case3: 3.5MB flash memory and 1MB ENVM */
#define MAIN_FLASH_DFLASH0_BASE_ADDRESS                 ((uint32_t)0x08200000U)                             /*!< main flash data flash0 base address */
#define MAIN_FLASH_BANK1_BASE_ADDRESS                   ((uint32_t)0x08300000U)                             /*!< main flash bank1 base address */
#define MAIN_FLASH_BANK0_BASE_ADDRESS                   ((uint32_t)0x08400000U)                             /*!< main flash bank0 base address */
#define MAIN_FLASH_DFLASH1_BASE_ADDRESS                 ((uint32_t)0x08500000U)                             /*!< main flash data flash1 base address */

#define ENVM_SIZE                                       ((uint32_t)0x00100000U)                             /*!< ENVM size */
#define MAIN_FLASH_SIZE                                 ((uint32_t)0x00380000U)                             /*!< main flash size */
#define MAIN_FLASH_DFLASH0_SIZE                         ((uint32_t)0x00100000U)                             /*!< main flash data flash0 size */
#define MAIN_FLASH_BANK1_SIZE                           ((uint32_t)0x00100000U)                             /*!< main flash bank1 size */
#define MAIN_FLASH_BANK0_SIZE                           ((uint32_t)0x00100000U)                             /*!< main flash bank0 size */
#define MAIN_FLASH_DFLASH1_SIZE                         ((uint32_t)0x00080000U)                             /*!< main flash data flash1 size */

#elif defined(NVM_VER_CASE4)
/* case4: 0MB flash memory and 1.625MB ENVM */
#define ENVM_SIZE                                       ((uint32_t)0x001A0000U)                             /*!< ENVM size */

#else
/* case1: 7.5MB flash memory and 2MB ENVM */
#define MAIN_FLASH_DFLASH0_BASE_ADDRESS                 ((uint32_t)0x08200000U)                             /*!< main flash data flash0 base address */
#define MAIN_FLASH_BANK1_BASE_ADDRESS                   ((uint32_t)0x08500000U)                             /*!< main flash bank1 base address */
#define MAIN_FLASH_BANK0_BASE_ADDRESS                   ((uint32_t)0x08700000U)                             /*!< main flash bank0 base address */
#define MAIN_FLASH_DFLASH1_BASE_ADDRESS                 ((uint32_t)0x08900000U)                             /*!< main flash data flash1 base address */

#define ENVM_SIZE                                       ((uint32_t)0x00200000U)                             /*!< ENVM size */
#define MAIN_FLASH_SIZE                                 ((uint32_t)0x00780000U)                             /*!< main flash size */
#define MAIN_FLASH_DFLASH0_SIZE                         ((uint32_t)0x00300000U)                             /*!< main flash data flash0 size */
#define MAIN_FLASH_BANK1_SIZE                           ((uint32_t)0x00200000U)                             /*!< main flash bank1 size */
#define MAIN_FLASH_BANK0_SIZE                           ((uint32_t)0x00200000U)                             /*!< main flash bank0 size */
#define MAIN_FLASH_DFLASH1_SIZE                         ((uint32_t)0x00080000U)                             /*!< main flash data flash1 size */
#endif /* NVM_VER_CASEx */

#define FLASH_PAGE_SIZE                                 ((uint32_t)0x00001000U)                             /*!< flash size */
#define SECTOR_SIZE                                     ((uint32_t)0x00010000U)                             /*!< sector size */
#define SYNC_SIZE_UNIT                                  ((uint32_t)0x00010000U)                             /*!< sync area granularity */
#define SCR_SIZE_UNIT                                   ((uint32_t)0x00001000U)                             /*!< secure area granularity */
#define DCRP_SIZE_UNIT                                  ((uint32_t)0x00001000U)                             /*!< DCRP area granularity */
#define REPAIR_ADDRESS_UNIT                             ((uint32_t)0x00000020U)                             /*!< repair offset address granularity */
#define BAD_BLOCK_ADDRESS_UNIT                          ((uint32_t)0x00000020U)                             /*!< bad block address granularity */

#define ENVM_TIMEOUT_COUNT                              ((uint32_t)0xFFFFFFFFU)                             /*!< count to judge of ENVM timeout */
#define FLASH_TIMEOUT_COUNT                             ((uint32_t)0xFFFFFFFFU)                             /*!< count to judge of flash timeout */
#define NVMC_TIMEOUT_COUNT                              ((uint32_t)0xFFFFFFFFU)                             /*!< count to judge of NVMC timeout */
#define OTP_TIMEOUT_COUNT                               ((uint32_t)0x00FFFFFFU)                             /*!< count to judge of OTP timeout */

#define INVLD_ADDRESS_FLAG                              ((uint8_t)0x00U)                                    /*!< the address is invalid */
#define VLD_ADDRESS_FLAG                                ((uint8_t)0x01U)                                    /*!< the address is valid */

/* OTP parameters' logical address */
#define OTP_USER_CFG_CTL0_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0000U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL0 low 16bits */
#define OTP_USER_CFG_CTL0_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF0020U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL0 high 16bits */
#define OTP_USER_CFG_CTL1_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0040U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL1 low 16bits */
#define OTP_USER_CFG_CTL2_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0060U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL2 low 16bits */
#define OTP_USER_CFG_CTL2_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF0080U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL2 high 16bits */
#define OTP_USER_CFG_CTL3_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF00A0U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL3 low 16bits */
#define OTP_USER_CFG_CTL3_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF00C0U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL3 high 16bits */
#define OTP_USER_CFG_CTL4_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF00E0U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL4 low 16bits */
#define OTP_USER_CFG_CTL5_LOW_16BITS_AXI_ADDR           ((uint32_t)0x1FFF0100U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL5 low 16bits */
#define OTP_USER_CFG_CTL5_HIGH_16BITS_AXI_ADDR          ((uint32_t)0x1FFF0120U)                             /*!< AXI access address of OTP user configuration parameter in NVMC_OTP_USER_CTL5 high 16bits */
#define OTP_USER_DBGPSWD_DATA_AXI_ADDR                  ((uint32_t)0x1FFF0140U)                             /*!< AXI write access address of OTP user configuration debug password parameter */
#define OTP_AES_KEY_AXI_ADDR                            ((uint32_t)0x1FFF01C0U)                             /*!< AXI write access address of OTP user configuration aes key parameter */
#define OTP_USER_DATA_AXI_ADDR                          ((uint32_t)0x1FFF02C0U)                             /*!< AXI access address of OTP user data parameter */

