wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* invalid DCRP area value */
#define INVALID_DCRP_START_ADDR                         ((uint32_t)0x000000FFU)                             /*!< the start address to make DCRP area invalid */
#define INVALID_DCRP_END_ADDR                           ((uint32_t)0x00000000U)                             /*!< the end address to make DCRP area invalid */

/* invalid SCR area value */
#define INVALID_SCR_START_ADDR                          ((uint32_t)0x000000FFU)                             /*!< the start address to make SCR area invalid */
#define INVALID_SCR_END_ADDR                            ((uint32_t)0x00000000U)                             /*!< the end address to make SCR area invalid */

/* constants definitions */
/* ENVM state */
typedef enum {
    ENVM_READY = 0U,                                                                                        /*!< ENVM operation has been completed */
    ENVM_BUSY,                                                                                              /*!< ENVM operation is in progress */
    ENVM_WPERR,                                                                                             /*!< ENVM erase/program protection error */
    ENVM_PGSERR,                                                                                            /*!< ENVM program sequence error */
    ENVM_RPERR,                                                                                             /*!< ENVM read protection error */
    ENVM_RSERR,                                                                                             /*!< ENVM read secure error */
    ENVM_AUTOECCSERRDET,                                                                                    /*!< ENVM one bit detect error */
    ENVM_AUTOECCDERRDET,                                                                                    /*!< ENVM two bits detect error */
    ENVM_CRCREADY,                                                                                          /*!< ENVM CRC operation has been completed */
    ENVM_CRCBUSY,                                                                                           /*!< ENVM CRC operation is in progress */
    ENVM_CRCRERR,                                                                                           /*!< ENVM CRC read error */
    ENVM_OTAFAIL,                                                                                           /*!< ENVM OTA fail error */
    ENVM_COPYSTRERR,                                                                                        /*!< ENVM Copy startup failure error */
    ENVM_NMIERRINT,                                                                                         /*!< ENVM AXI read, repair failure with 3-bit error */
    ENVM_REPAIR_BUSY,                                                                                       /*!< ENVM repair operation is in progress */
    ENVM_REPAIR_ECC1CNTIF,                                                                                  /*!< ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold */
    ENVM_REPAIR_ECC2CNTIF,                                                                                  /*!< ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold */
    ENVM_REPAIR_FLBLANK,                                                                                    /*!< ENVM Flash backup content is blank error */
    ENVM_REPAIR_END,                                                                                        /*!< ENVM self-repair has been completed */
    ENVM_REPAIR_REPSTRERR,                                                                                  /*!< ENVM self-check repair configuration error */
    ENVM_TOERR                                                                                              /*!< ENVM timeout error */
} envm_state_enum;

/* flash state */
typedef enum {
    FLASH_READY = 0U,                                                                                       /*!< flash operation has been completed */
    FLASH_BUSY,                                                                                             /*!< flash operation is in progress */
    FLASH_WPERR,                                                                                            /*!< flash erase/program protection error */
    FLASH_PGSERR,                                                                                           /*!< flash program sequence error */
    FLASH_RPERR,                                                                                            /*!< flash read protection error */
    FLASH_RSERR,                                                                                            /*!< flash read secure error */
    FLASH_ECCDET,                                                                                           /*!< flash two bits detect error */
    FLASH_TOERR                                                                                             /*!< flash timeout error */
} flash_state_enum;

/* OTP state */
typedef enum {
    OTP_READY = 0U,                                                                                         /*!< OTP operation has been completed */
    OTP_BUSY,                                                                                               /*!< OTP operation is in progress */
    OTP_DATAERR,                                                                                            /*!< OTP Data error */
    OTP_PGLKERR,                                                                                            /*!< OTP Program at lock state error */
    OTP_MULTI_DATAERR,                                                                                      /*!< OTP Multi-redundant data error */
    OTP_PGSERR,                                                                                             /*!< OTP program sequence error */
    OTP_TOERR                                                                                               /*!< OTP timeout error */
} otp_state_enum;

/* NVMC state */
typedef enum {
    NVMC_OB_READY = 0U,                                                                                     /*!< option byte modification has been completed */
    NVMC_OB_BUSY,                                                                                           /*!< option byte modification is in progress */
    NVMC_OB_OBMERR,                                                                                         /*!< option byte modification error */
    NVMC_OB_REPSTRERR,                                                                                      /*!< option byte self-check repair configuration error */
    NVMC_OB_TOERR,                                                                                          /*!< option byte modification timeout error */
    NVMC_HSPC,                                                                                              /*!< high security protection */
    NVMC_OB_DCRP_SCR_PROT                                                                                   /*!< DCRP/SCR protection */
} nvmc_ob_state_enum;

/* ECC type */
typedef enum {
    ITCM_ECC = 0U,                                                                                          /*!< ITCM ECC */
    DTCM0_ECC,                                                                                              /*!< DTCM0 ECC */
    DTCM1_ECC,                                                                                              /*!< DTCM1 ECC */
    R2_SRAM_ECC,                                                                                            /*!< R2 SRAM ECC */
    R1_SRAM_ECC,                                                                                            /*!< R1 SRAM ECC */
    R0_SRAM_ECC,                                                                                            /*!< R0 SRAM ECC */
    ENVM_ECC                                                                                                /*!< ENVM ECC */
} ecc_type_enum;

/* NVMC area */
typedef enum {
    WP_AREA_ENVM  = 0U,                                                                                     /*!< ENVM area */
    WP_AREA_FLASH = 1U                                                                                      /*!< main flash area */
} wp_area_enum;

/* OTP parameter size enum, in byte unit */
typedef enum {
    BASE_USER_CFG_SIZE = 20U,                                                                               /*!< user configure size */
    USER_DP_SIZE       = 8U,                                                                                /*!< debug password size */
    AES_KEY_SIZE       = 16U,                                                                               /*!< AES key size */
    USER_DATA_SIZE     = 372U                                                                               /*!< user data size */
} otp_para_size;

