wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check wait state counter value */
#define NOT_ENVM_PERFCTL_WSCNT(wscnt)                            (((wscnt) != PERFCTL_WSCNT_1) && ((wscnt) != PERFCTL_WSCNT_2) && ((wscnt) != PERFCTL_WSCNT_3) && \
                                                                 ((wscnt) != PERFCTL_WSCNT_4) && ((wscnt) != PERFCTL_WSCNT_5) && ((wscnt) != PERFCTL_WSCNT_6) && \
                                                                 ((wscnt) != PERFCTL_WSCNT_7) && ((wscnt) != PERFCTL_WSCNT_8) && ((wscnt) != PERFCTL_WSCNT_9) && \
                                                                 ((wscnt) != PERFCTL_WSCNT_10) && ((wscnt) != PERFCTL_WSCNT_11) && ((wscnt) != PERFCTL_WSCNT_12) && \
                                                                 ((wscnt) != PERFCTL_WSCNT_13) && ((wscnt) != PERFCTL_WSCNT_14) && ((wscnt) != PERFCTL_WSCNT_15))
/* check flash buffer prefetch */
#define NOT_FLASH_PREFETCH(line)                                 (((line) != FLASH_NO_PREFETCH) && ((line) != FLASH_PREFETCH_1_LINE) && ((line) != FLASH_PREFETCH_3_LINE))

/* check ENVM general buffer size */
#define NOT_ENVM_GP_BUF_SIZE(size)                               (((size) != ENVM_GP_BUF_SIZE1) && ((size) != ENVM_GP_BUF_SIZE2) && ((size) != ENVM_GP_BUF_SIZE4) && \
                                                                 ((size) != ENVM_GP_BUF_SIZE8))
/* check ENVM CPU buffer size */
#define NOT_ENVM_CPU_BUF_SIZE(size)                              (((size) != ENVM_CPU_BUF_SIZE1) && ((size) != ENVM_CPU_BUF_SIZE2) && ((size) != ENVM_CPU_BUF_SIZE4) && \
                                                                 ((size) != ENVM_CPU_BUF_SIZE8))
#if defined(NVM_VER_CASE2)
/* check ENVM program address */
#define NOT_ENVM_VALID_ADDRESS(address)                          (((address) < 0x08000000U) || ((address) > 0x081FFFFFU))
#elif defined(NVM_VER_CASE3)
/* check ENVM program address */
#define NOT_ENVM_VALID_ADDRESS(address)                          (((address) < 0x08000000U) || ((address) > 0x080FFFFFU))
#elif defined(NVM_VER_CASE4)
/* check ENVM program address */
#define NOT_ENVM_VALID_ADDRESS(address)                          (((address) < 0x08000000U) || ((address) > 0x0819FFFFU))
#else
/* check ENVM program address */
#define NOT_ENVM_VALID_ADDRESS(address)                          (((address) < 0x08000000U) || ((address) > 0x081FFFFFU))
#endif /* NVM_VER_CASEx */

/* check ENVM CPU buffer size */
#define NOT_BADBLOCK_VALID_ADDRESS_INDEX(index)                  (((index) != 0U) && ((index) != 1U) && ((index) != 2U) && ((index) != 3U))

#ifndef NVM_VER_CASE4
#if defined(NVM_VER_CASE2)
/* check FLASH program address */
#define NOT_FLASH_VALID_ADDRESS(address)                         (((address) < 0x08200000U) || ((address) > 0x0857FFFFU))
#elif defined(NVM_VER_CASE3)
/* check FLASH program address */
#define NOT_FLASH_VALID_ADDRESS(address)                         (((address) < 0x08200000U) || ((address) > 0x0857FFFFU))
#else
/* check FLASH program address */
#define NOT_FLASH_VALID_ADDRESS(address)                         (((address) < 0x08200000U) || ((address) > 0x0897FFFFU))
#endif /* NVM_VER_CASEx */
#endif /* NVM_VER_CASE4 */

/* check OTP program address */
#define NOT_OTP_VALID_ADDRESS(address)                           ((((address) - 0x1FFF0000U) % 0x20U != 0U) || ((address) < 0x1FFF0000U) || ((address) > (0x1FFF0000U + 0x20U * 207U)))

/* check security protection value */
#define NOT_NVMC_SPC_VALUE(ob_spc)                               (((ob_spc) != OB_NSPC) && ((ob_spc) != OB_LSPC) && ((ob_spc) != OB_HSPC))

/* check DATA value */
#define NOT_OB_DATA_RANGE(user_data)                             ((user_data) > 0x00007FFFU)

/* check ITCM size in ITCM/DTCM shared RAM */
#define NOT_OB_ITCM_DTCM_SHARED_ITCM_SIZE(itcm_size)             (((itcm_size) != OB_ITCM_DTCM_SHARED_ITCM_0KB) && ((itcm_size) != OB_ITCM_DTCM_SHARED_ITCM_64KB) && ((itcm_size) != OB_ITCM_DTCM_SHARED_ITCM_128KB) && \
                                                                 ((itcm_size) != OB_ITCM_DTCM_SHARED_ITCM_192KB) && ((itcm_size) != OB_ITCM_DTCM_SHARED_ITCM_256KB))

/* check ITCM size in ITCM/AXI shared RAM */
#define NOT_OB_ITCM_AXI_SHARED_ITCM_SIZE(itcm_size)              (((itcm_size) != OB_ITCM_AXI_SHARED_ITCM_0KB) && ((itcm_size) != OB_ITCM_AXI_SHARED_ITCM_64KB) && ((itcm_size) != OB_ITCM_AXI_SHARED_ITCM_128KB) && \
                                                                 ((itcm_size) != OB_ITCM_AXI_SHARED_ITCM_192KB) && ((itcm_size) != OB_ITCM_AXI_SHARED_ITCM_256KB))

/* check the reset value of the CPUBUSTO bit in SYSCFG_BUSTO */
#define NOT_OB_CPUBUSTO_RESET_VALUE(cpubusto_value)              (((cpubusto_value) != OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_DISABLE) && ((cpubusto_value) != OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_ENABLE))

/* check boot pin configuration */
#define NOT_NVMC_BOOT_PIN_VALUE(boot_pin)                        (((boot_pin) != BOOT_PIN_0) && ((boot_pin) != BOOT_PIN_1))

#if defined(NVM_VER_CASE2)
/* check DCRP area start address */
#define NOT_NVMC_DCRP_AREA_START(dcrp_start)                      ((dcrp_start) > 0x1FFU)
/* check DCRP area end address */
#define NOT_NVMC_DCRP_AREA_END(dcrp_end)                          ((dcrp_end) > 0x1FFU)
/* check SCR area start address */
#define NOT_NVMC_SCR_AREA_START(scr_start)                        ((scr_start) > 0x1FFU)
/* check SCR area end address */
#define NOT_NVMC_SCR_AREA_END(scr_end)                            ((scr_end) > 0x1FFU)
#elif defined(NVM_VER_CASE3)
/* check DCRP area start address */
#define NOT_NVMC_DCRP_AREA_START(dcrp_start)                      ((dcrp_start) > 0x0FFU)
/* check DCRP area end address */
#define NOT_NVMC_DCRP_AREA_END(dcrp_end)                          ((dcrp_end) > 0x0FFU)
/* check SCR area start address */
#define NOT_NVMC_SCR_AREA_START(scr_start)                        ((scr_start) > 0x0FFU)
/* check SCR area end address */
#define NOT_NVMC_SCR_AREA_END(scr_end)                            ((scr_end) > 0x0FFU)
#elif defined(NVM_VER_CASE4)
/* check DCRP area start address */
#define NOT_NVMC_DCRP_AREA_START(dcrp_start)                      ((dcrp_start) > 0x19FU)
/* check DCRP area end address */
#define NOT_NVMC_DCRP_AREA_END(dcrp_end)                          ((dcrp_end) > 0x19FU)
/* check SCR area start address */
#define NOT_NVMC_SCR_AREA_START(scr_start)                        ((scr_start) > 0x19FU)
/* check SCR area end address */
#define NOT_NVMC_SCR_AREA_END(scr_end)                            ((scr_end) > 0x19FU)
#else
/* check DCRP area start address */
#define NOT_NVMC_DCRP_AREA_START(dcrp_start)                      ((dcrp_start) > 0x1FFU)
/* check DCRP area end address */
#define NOT_NVMC_DCRP_AREA_END(dcrp_end)                          ((dcrp_end) > 0x1FFU)
/* check SCR area start address */
#define NOT_NVMC_SCR_AREA_START(scr_start)                        ((scr_start) > 0x1FFU)
/* check SCR area end address */
#define NOT_NVMC_SCR_AREA_END(scr_end)                            ((scr_end) > 0x1FFU)
#endif /* NVM_VER_CASEx */

