wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_nvmc.h
/* check copy size */
#define NOT_NVMC_OB_COPY_SIZE(value)                              ((value) > 0x3FU)
/* check two bit error counter interrupt threshold during self-check */
#define NOT_NVMC_OB_ERR2CNT_THRESHOLD(err2_cnt_threshold)         ((err2_cnt_threshold) > 0x1FU)
/* check one bit error counter interrupt threshold during self-check */
#define NOT_NVMC_OB_ERR1CNT_THRESHOLD(err1_cnt_threshold)         ((err1_cnt_threshold) > 0x1FU)
/* check sync area size */
#define NOT_NVMC_OB_SYNC_SIZE(value)                              ((value) > 0x1FU)

#if defined(NVM_VER_CASE2)
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0xFFFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0xFFFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0xFFFFU)
#elif defined(NVM_VER_CASE3)
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0x7FFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0x7FFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0x7FFFU)
#elif defined(NVM_VER_CASE4)
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0xCFFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0xCFFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0xCFFFU)
#else
/* check repair area start address */
#define NOT_NVMC_REPAIR_AREA_START(repair_start)                  ((repair_start) > 0xFFFFU)
/* check repair area end address */
#define NOT_NVMC_REPAIR_AREA_END(repair_end)                      ((repair_end) > 0xFFFFU)
/* check bad block address */
#define NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)                ((bad_block_address) > 0xFFFFU)
#endif /* NVM_VER_CASEx */

/* check bad block index */
#define NOT_NVMC_BAD_BLOCK_INDEX(index)                           ((index) > 0x3U)
/* check bad block addres valid status */
#define NOT_NVMC_BAD_BLOCK_VALID(bad_block_valid)                 ((bad_block_valid) > 0x1U)

#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* ENVM operation functions */
/* unlock ENVM_CTL */
void nvmc_envm_unlock(void);
/* lock ENVM_CTL */
void nvmc_envm_lock(void);
/* set the ENVM wait state counter value */
void nvmc_envm_wscnt_set(uint8_t wscnt);
/* empty ENVM buffer (general buffer and CPU buffer) */
void nvmc_envm_buf_empty(void);
/* configure flash buffer */
void nvmc_flash_buffer_configure(uint32_t buf_configure);
/* configure ENVM general buffer size */
void nvmc_envm_gp_buffer_configure(uint32_t size);
/* configure ENVM CPU buffer size */
void nvmc_envm_cpu_buffer_configure(uint32_t size);
/* ENVM program 32 bytes at the corresponding address */
ErrStatus nvmc_envm_32bytes_program(uint32_t address, uint64_t data[]);
/* ENVM erase sector */
envm_state_enum nvmc_envm_sector_erase(uint32_t address);
/* erase whole ENVM */
envm_state_enum nvmc_envm_mass_erase(void);
/* erase whole chip */
ErrStatus nvmc_typical_chip_erase(void);
/*erase whole chip, including ENVM and flash*/
ErrStatus nvmc_protection_removed_chip_erase(void);
/* CRC calculate ENVM data block */
envm_state_enum nvmc_envm_crc_calculate(uint32_t *crc_value);
/* software trigger ENVM repair */
envm_state_enum nvmc_envm_repair(void);
/* get ENVM read only bad block address after self-check */
uint8_t nvmc_envm_read_only_bad_block_address_get(uint32_t index, uint32_t *bad_block_address, uint32_t *error_stat);

/* ENVM interrupts and flags management functions */
/* get ENVM operation flag */
FlagStatus nvmc_envm_flag_get(uint32_t envm_flag);
/* clear ENVM pending flag */
void nvmc_envm_flag_clear(uint32_t envm_flag);
/* enable ENVM interrupt */
void nvmc_envm_interrupt_enable(uint32_t envm_int);
/* disable ENVM interrupt */
void nvmc_envm_interrupt_disable(uint32_t envm_int);
/* get ENVM operation interrupt flag */
FlagStatus nvmc_envm_interrupt_flag_get(uint8_t envm_int_flag);
/* clear ENVM operation interrupt flag */
void nvmc_envm_interrupt_flag_clear(uint8_t envm_int_flag);
/* get ENVM repair pending flag */
FlagStatus nvmc_envm_repair_flag_get(uint32_t envm_repair_flag);
/* clear ENVM repair pending flag */
void nvmc_envm_repair_flag_clear(uint32_t envm_repair_flag);
/* enable ENVM repair interrupt */
void nvmc_envm_repair_interrupt_enable(uint32_t envm_repair_int);
/* disable ENVM repair interrupt */
void nvmc_envm_repair_interrupt_disable(uint32_t envm_repair_int);
/* get ENVM repair operation interrupt flag */
FlagStatus nvmc_envm_repair_interrupt_flag_get(uint8_t envm_repair_int_flag);
/* clear ENVM repair operation interrupt flag */
void nvmc_envm_repair_interrupt_flag_clear(uint8_t envm_repair_int_flag);
/* get the number of 2 bit error occurrences without repair during the self-check */
uint8_t nvmc_envm_ecc2_cnt_without_repair_get(void);
/* get the number of 1 bit error occurrences without repair during the self-check */
uint8_t nvmc_envm_ecc1_cnt_without_repair_get(void);
/* get the number of error count fail to repair during self-check */
uint8_t nvmc_envm_robbcnt_get(void);
/* get the error status during self-check */
uint8_t nvmc_envm_repair_error_status_get(void);
/* clear the number of 2 bit error occurrences without repair during self-check */
void nvmc_envm_ecc2_cnt_without_repair_clear(void);
/* clear the number of 1 bit error occurrences without repair during self-check */
void nvmc_envm_ecc1_cnt_without_repair_clear(void);
/* clear the number of error count fail to repair during self-check */
void nvmc_envm_robbcnt_clear(void);
/* clear error status during self-check */
void nvmc_envm_repair_error_status_clear(void);
/* clear the result of repair during self-check, including counter, error address, and status */
void nvmc_envm_self_check_repair_flag_clear(void);
/* clear the result of repair during ENVM axi read, including counter, error address, and status */
void nvmc_envm_axi_read_repair_flag_clear(void);

/* flash operation functions */
/* unlock NVMC_FLASH_CTL */
void nvmc_flash_unlock(void);
/* lock NVMC_FLASH_CTL */
void nvmc_flash_lock(void);
/* flash program a double-word at the corresponding address */
flash_state_enum nvmc_flash_doubleword_program(uint32_t address, uint64_t data);
/* flash program 32 bytes at the corresponding address */
flash_state_enum nvmc_flash_32bytes_program(uint32_t address, uint64_t data[]);
/* flash erase page */
flash_state_enum nvmc_flash_page_erase(uint32_t address);
/* flash erase sector */
flash_state_enum nvmc_flash_sector_erase(uint32_t address);
/* flash erase whole chip */
flash_state_enum nvmc_flash_mass_erase(void);

/* flash interrupts and flags management functions */
/* get flash operation flag */
FlagStatus nvmc_flash_flag_get(uint32_t flash_flag);
/* clear flash pending flag */
void nvmc_flash_flag_clear(uint32_t flash_flag);
/* enable flash interrupt */
void nvmc_flash_interrupt_enable(uint32_t flash_int);
/* disable flash interrupt */
void nvmc_flash_interrupt_disable(uint32_t flash_int);
/* get flash interrupt operation flag */
FlagStatus nvmc_flash_interrupt_flag_get(uint8_t flash_int_flag);
/* clear flash interrupt pending flag */
void nvmc_flash_interrupt_flag_clear(uint8_t flash_int_flag);

/* OTP operation functions */
otp_state_enum nvmc_otp_halfword_program(uint32_t address, uint16_t data);
/* program all AES KEY parameter */
otp_state_enum nvmc_otp_aes_key_all_program(uint16_t buf[]);
/* program all debug password parameter */
otp_state_enum nvmc_otp_dp_all_program(uint16_t buf[]);
/* program all user data parameter */
otp_state_enum nvmc_otp_user_data_all_program(uint16_t buf[]);
/* start OTP repair */
otp_state_enum nvmc_otp_repair(void);

/* OTP interrupts and flags management functions */
/* get OTP operation flag */
FlagStatus nvmc_otp_flag_get(uint32_t otp_flag);
/* clear OTP pending flag */
void nvmc_otp_flag_clear(uint32_t otp_flag);
/* enable OTP interrupt */
void nvmc_otp_interrupt_enable(uint32_t otp_int);
/* disable OTP interrupt */
void nvmc_otp_interrupt_disable(uint32_t otp_int);
/* get OTP interrupt operation flag */
FlagStatus nvmc_otp_interrupt_flag_get(uint8_t otp_int_flag);
/* clear OTP interrupt pending flag */
void nvmc_otp_interrupt_flag_clear(uint8_t otp_int_flag);

/* NVMC option bytes operation functions */
/* unlock the option byte operation */
void nvmc_ob_unlock(void);
/* lock the option byte operation */
void nvmc_ob_lock(void);
/* send option byte change command */
nvmc_ob_state_enum nvmc_ob_start(void);
/* modified option byte to factory value */
nvmc_ob_state_enum nvmc_ob_factory_value_config(void);
/* program the option bytes OBSTAT0 */
nvmc_ob_state_enum nvmc_ob_obstat0_config(uint32_t ob_obstat0, uint32_t ob_obstat0_mask);
/* enable secure access mode */
nvmc_ob_state_enum nvmc_ob_secure_access_mode_enable(void);
/* disable secure access mode */
nvmc_ob_state_enum nvmc_ob_secure_access_mode_disable(void);
/* configure the option byte security protection */
nvmc_ob_state_enum nvmc_ob_security_protection_config(uint32_t ob_spc);
/* program low power related option byte configuration */
nvmc_ob_state_enum nvmc_ob_low_power_write(uint32_t ob_deepsleep, uint32_t ob_stdby, uint32_t ob_fwdg_suspend_deepsleep,
        uint32_t ob_fwdg_suspend_standby);
/* configure option byte BOR threshold value */
nvmc_ob_state_enum nvmc_ob_bor_threshold_config(uint32_t ob_bor_th);
/* enable hardware watchdog */
nvmc_ob_state_enum nvmc_ob_hardware_watchdog_enable(void);
/* disable hardware watchdog */
nvmc_ob_state_enum nvmc_ob_hardware_watchdog_disable(void);
/* enable OTA check */
nvmc_ob_state_enum nvmc_ob_ota_check_enable(void);
/* disable OTA check */
nvmc_ob_state_enum nvmc_ob_ota_check_disable(void);
/* enable firmware update */
nvmc_ob_state_enum nvmc_ob_firmware_update_enable(void);
/* disable firmware update */
nvmc_ob_state_enum nvmc_ob_firmware_update_disable(void);
/* configure option byte bank0 as backup of ENVM */
nvmc_ob_state_enum nvmc_ob_flash_bank0_backup_envm(void);
/* configure option byte bank1 as backup of ENVM */
nvmc_ob_state_enum nvmc_ob_flash_bank1_backup_envm(void);
/* enable ecc */
nvmc_ob_state_enum nvmc_ob_ecc_enable(uint32_t ecc_type);
/* disable ecc */
nvmc_ob_state_enum nvmc_ob_ecc_disable(uint32_t ecc_type);
/* enable pipeline mode */
nvmc_ob_state_enum nvmc_ob_pipemode_enable(void);
/* disable pipeline mode */
nvmc_ob_state_enum nvmc_ob_pipemode_disable(void);

/* program the option bytes OBSTAT1 */
nvmc_ob_state_enum nvmc_ob_obstat1_config(uint32_t ob_obstat1, uint32_t ob_obstat1_mask);
/* program the option bytes user data */
nvmc_ob_state_enum nvmc_ob_data_config(uint32_t user_data);
/* configure option byte ITCM size in ITCM/DTCM shared RAM */
nvmc_ob_state_enum nvmc_ob_itcm_dtcm_shared_ram_config(uint32_t itcm_size);
/* configure option byte ITCM size in ITCM/AXI shared RAM */
nvmc_ob_state_enum nvmc_ob_itcm_axi_shared_ram_config(uint32_t itcm_size);
/* configure option byte CPUBUSTO */
nvmc_ob_state_enum nvmc_ob_cpubusto_reset_value_config(uint32_t cpubusto_value);

